{"events":[{"index":1,"date":"Sep-99","title":"Pilot Study Starts","description":"The first cervical-fusion patient is treated with bone morphogenetic protein (BMP) in a Food and Drug Administration-approved pilot study. Cervical fusion thus becomes <a href='https://www.ncbi.nlm.nih.gov/pubmed/12811263' target='_new'>one of the original procedures</a> for which BMP is tested on humans.","media":null},
{"index":2,"date":"Jan-99","title":"Medtronic Buys Infuse","description":"Minneapolis-based Medtronic completes a $3 billion, all-stock deal announced in late 1998 to <a href='https://www.sec.gov/Archives/edgar/data/64670/0000914190-99-000025.txt' target='_new'>acquire Memphis’ Sofamor Danek</a>, which owns the rights to sell a specific form of a BMP, called rhBMP-2.","media":null},
{"index":3,"date":"Jan-02","title":"Off-Label Concerns raised","description":"When Medtronic applies for commercial approval for Infuse to treat lower-back pain, the <a href='https://www.documentcloud.org/documents/2779798-Jan-2002-FDA-Infuse-Panel-Transcript.html' target='_new'>FDA’s experts are warned</a> doctors will use rhBMP-2 in many parts of the body, not just where it was approved. Panel members are urged not “speculate” on other uses besides lower-back spine fusion.","media":null},
{"index":4,"date":"Jul-02","title":"Infuse Approved","description":"The FDA <a href='http://www.accessdata.fda.gov/cdrh_docs/pdf/P000058a.pdf' target='_new'>grants Medtronic’s premarket approval application</a> for a product called, “the InFUSE Bone Graft/LT-CAGE Lumbar Tapered Fusion Device,” which includes both a metal device and a collagen sponge soaked with rhBMP-2. The device is considered safe in the lower back in skeletally mature patients.","media":null},
{"index":5,"date":"Jun-03","title":"Cervical Results","description":"The 1999 pilot study of Infuse in cervical fusions, <a href='https://www.ncbi.nlm.nih.gov/pubmed/12811263' target='_new'>published in Spine</a>, reports no device-related adverse events or complications among 18 Infuse cervical fusion patients. Years later, the study report is criticized for one of the early company-funded, company-edited papers that underestimated the risks and helped drive off-label use.","media":null},
{"index":6,"date":"Apr-04","title":"‘Concerns’ Email","description":"Medtronic consultant Dr. Scott Boden tells Medtronic Spine executive Rick Treharne that he has begun hearing ‘concerns’ about swelling in BMP cervical fusion cases, including one colleague who saw a “golf-ball size mass” in a BMP patient. Boden also mentions a “death in the literature.” (Source: <a href='https://www.documentcloud.org/documents/2420694-full-infuse-senate-finance-committee-report.html' target='_new'>Senate Finance Committee report</a>, Pgs. 2,119-2,121)","media":null},
{"index":7,"date":"Jun-04","title":"The No. 1 Complaint","description":"By June, “swelling in the cervical spine” has become Medtronic’s “No. 1 complaint” about BMP, Treharne tells Medtronic consultant, Dr. Kenneth Burkus in an email. However, since swelling can also happen without BMP, Treharne writes, “In sum, I just do not, at this time, see anything here to worry about. (Source: <a href='https://www.documentcloud.org/documents/2420694-full-infuse-senate-finance-committee-report.html' target='_new'>Senate Finance Committee report</a>, Pgs. 2,122-2,126)","media":null},
{"index":8,"date":"Sep-04","title":"Medtronic Safety Alert","description":"Medtronic sends doctors a <a href='https://www.documentcloud.org/documents/3895626-2004-Dear-Doctor-Letter-on-Infuse.html' target='_new'>one-page “Safety Alert,”</a> signed by Treharne, reporting an undisclosed number of cases of “localized soft tissue edema” following off-label surgeries using Infuse in anterior cervical fusions. (Edema is the medical term for swelling.) “These occasional complaints have not been associated with neurological deterioration … it is unknown whether these incidences are solely related to the use of INFUSE Bone Graft. … Our investigation is still ongoing.” The number of off-label cervical-spine fusions with Infuse in the U.S. then doubles between 2004 and 2006.","media":null},
{"index":9,"date":"Nov-06","title":"Internal Study Begins","description":"Patients begin signing <a href='https://www.documentcloud.org/documents/3990169-MOAS-Signed-Informed-Consent-Affirmation.html' target='_new'>informed consent affirmation forms</a>for a Medtronic-sponsored project titled, “A Retrospective Study of the Use of Infuse Bone Graft In Clinical Practice.” Eventually 3,647 “real world” surgeries are studied, the vast majority of them for unapproved uses of Infuse. Medtronic officials say FDA was aware of this study.","media":null},
{"index":10,"date":"Apr-07","title":"First Cervical Complication","description":"The first report of a cervical fusion surgery with complications is received in Medtronic’s retrospective study. The patient had a “neurological deficit/dysfunction” following a C5-C6 anterior cervical fusion with a 2.8 milliliter packet of BMP.","media":null},
{"index":11,"date":"Jun-07","title":"Pivotal Study Begins","description":"At the same time that Medtronic is collecting data for its internal retrospective study, the first patient is treated in a totally separate pivotal study of Infuse cervical fusion. This prospective FDA-approved trial includes 224 experimental-arm patients, and ends in January 2010. The primary results of this trial are never published in a journal. <a href='https://clinicaltrials.gov/ct2/show/results/NCT00485173?term=Pivotal+Infuse+Cervical+PEEK&rank=1&sect=X4301256' target='_new'>Tabulated results</a> posted online, in March 2013, show five Infuse patient deaths and more dysphagia in the treatment arm.","media":null},
{"index":12,"date":"Nov-07","title":"Last Cervical Complication","description":"Meanwhile, the final cervical fusion in the internal study is recorded, bringing the number of cases of cervical fusions with complications in Medtronic files to at least 118. The study is closed down ahead of schedule, and the results are archived internally. Medtronic executives later explain that the company wasn’t clear on its duty to report the results, and that the study was stopped after the FDA indicated it could not be used to expand the label.","media":null},
{"index":13,"date":"Jul-08","title":"FDA Alert","description":"<a href='http://www.fda.gov/MedicalDevices/Safety/AlertsandNotices/PublicHealthNotifications/ucm062000.htm' target='_new'>The FDA warns</a> of life-threatening complications associated with rhBMP when used in the cervical spine. The report is based on at least 38 reports of swelling in the neck, leading to compression of airways and “neurological structures” in the neck, and difficulties swallowing, breathing and speaking. The warning hurts Infuse sales.","media":null},
{"index":14,"date":"Oct-08","title":"DOJ Subpoena","description":"Medtronic receives a subpoena from the U.S. Attorney’s Office for the District of Massachusetts <a href='https://www.sec.gov/Archives/edgar/data/64670/000089710108002439/medtronic084960_10q.htm' target='_new'>requesting Infuse documents</a> (page 48). Data from the internal study, now closed and archived, are not provided. The federal investigation closes in 2012 without ever seeing the material.","media":null},
{"index":15,"date":"Nov-08","title":"Sales Slump","description":"Medtronic writes in a securities filing to investors that Infuse sales growth in the quarter slowed. “We believe growth was negatively impacted by physician and payor response to a FDA public health notice regarding use of bone morphogenetic protein (BMP) in cervical procedures and the overall regulatory scrutiny of off-label use in medical devices.” (Source: <a href='https://www.sec.gov/Archives/edgar/data/64670/000089710108002439/medtronic084960_10q.htm' target='_new'>quarterly earnings report</a>)","media":null},
{"index":16,"date":"Jul-09","title":"JAMA Results","description":"In the first national analysis of BMP use, researchers write <a href='http://jamanetwork.com/journals/jama/fullarticle/184181' target='_new'>in JAMA, the Journal of American Medical Association</a>, that cervical fusion procedures with BMP are associated with a 50 percent higher complication rate, longer hospital stays, and higher overall costs than the same procedure without the chemical. Other procedures using Infuse are not found to have higher risks compared to the same surgery without the product.","media":null},
{"index":17,"date":"Sep-10","title":"High Off-Label Use","description":"Off-label use of Infuse has skyrocketed. <a href='http://www.ncbi.nlm.nih.gov/pubmed/?term=Off-label+use+of+bone+morphogenetic+proteins+in+the+United+States+using+administrative+data' target='_new'>A study report published in Spine</a> finds that 85 percent of the 340,251 BMP surgeries between 2003 and 2007 were for off-label indications.","media":null},
{"index":18,"date":"Jun-11","title":"Senate Investigation","description":"U.S. Senate Finance Committee members <a href='http://www.finance.senate.gov/newsroom/chairman/release/?id=a7e974b6-b4b6-4e2c-a738-edefac30fcb6' target='_new'>send a letter to Medtronic CEO Omar Ishrak</a> asking for all documents pertaining to adverse postoperative events and/or medical complications relating to the use of rhBMP-2. The 2007 internal study data are never provided.","media":null},
{"index":19,"date":"Jun-11","title":"The Spine Journal","description":"The Spine Journal devotes a special issue to exposing a pattern of surgeons with financial ties to Medtronic omitting mention of serious side effects from Infuse studies, including the 2003 cervical-fusion pilot study report. The actual risk of postsurgical adverse events was 40 percent greater if Infuse was used during cervical fusion, the review article concludes. (p. 487)","media":null},
{"index":20,"date":"Jun-11","title":"Defending Infuse","description":"Incoming <a href='http://newsroom.medtronic.com/phoenix.zhtml?c=251324&p=irol-newsArticle&ID=1771294' target='_new'>Medtronic CEO Omar Ishrak says</a> The Spine Journal only questioned researchers’ work, not Medtronic’s underlying clinical-trial data on Infuse. “We strongly believe that the safety profile reported to the FDA and summarized in the product label support the safe use of rhBMP-2 for the identified indications.” <a href='http://wwwp.medtronic.com/newsroom/content/1309292749189.pdf' target='_new'>Medtronic</a> declares the company is working with the FDA to establish a national surveillance network to “better understand real-world use, including a broad range of safety signals and early detection of other rare events.”","media":null},
{"index":21,"date":"Aug-11","title":"Yale Study","description":"Because of the questions about the Infuse articles, Medtronic tells investors that it has given a $2.5 million grant to Yale University <a href='https://www.sec.gov/Archives/edgar/data/64670/000089710112000400/medtronic120959_10q.htm' target='_new'>“to oversee two independent, systematic reviews of all INFUSE-related clinical data”</a> (p. 49). The review will include <a href='http://www.infusebonegraft.com/healthcare-providers/about-infuse-bonegraft/the-yale-study/the-review-process/index.htm' target='_new'>all patient-level data from clinical trials</a> and past adverse-events that were submitted to the FDA. The 2007 internal study are not provided, and neither are data from the 2007 FDA-approved pivotal study of cervical fusion, for which the last patient was treated in 2010.","media":null},
{"index":22,"date":"May-12","title":"DOJ Probe Ends","description":"Medtronic announces that federal prosecutors in Boston have <a href='http://newsroom.medtronic.com/phoenix.zhtml?c=251324&p=irol-newsArticle&ID=1769480' target='_new'>closed their federal criminal and civil investigation</a>into Infuse. Medtronic is still answering civil demands from the Massachusetts attorney general’s office and a subpoena from the California attorney general’s office. (Source: <a href='https://www.sec.gov/Archives/edgar/data/64670/000089710112000400/medtronic120959_10q.htm' target='_new'>SEC filing</a>, page 35)","media":null},
{"index":23,"date":"Oct-12","title":"Senate Report","description":"The Senate Finance Committee <a href='http://www.finance.senate.gov/newsroom/chairman/download/?id=e54db17c-a475-4948-bd81-69c8740c6aaf' target='_new'>publishes a 2,315-page report</a> accusing Medtronic of creating bias in early Infuse studies, which may have risked patient health and influenced government payments. The Senate report reveals Medtronic emails from 2004 trying to downplay signs of problems in Infuse cervical fusions, and more email from 2006 trying to tone down a study report that concluded Infuse had a “causal” relationship with complications. The report also highlights emails that showed Medtronic trying to keep control over how postsurgical complications would be studied during a pivotal clinical trial of Infuse cervical fusions: “This way if a patient has an [adverse event] like cervical swelling, we can honestly say that it is not possible to know that the cause is definitely Infuse, and therefore the study need not be stopped,” the Medtronic official wrote. (Source: page 2,137 of <a href='https://www.documentcloud.org/documents/2420694-full-infuse-senate-finance-committee-report.html' target='_new'>SFC report</a>)","media":null},
{"index":24,"date":"Feb-13","title":"Study Data Rediscovered","description":"Medtronic employees say they rediscover the unreported 2007 internal study data in company archives, including 118 cervical fusion cases.","media":null},
{"index":25,"date":"Mar-13","title":"Pivotal Study Results","description":"Separate from the internal study, Medtronic finally reports the results of its pivotal study of cervical fusion with Infuse on clinicaltrials.gov. The data, neve published in a journal, show higher rates of dysphagia and death among Infuse patients.","media":null},
{"index":26,"date":"Jul-13","title":"FDA Informed","description":"Medtronic officials inform the FDA’s William Huff about the internal study data. It is suggested that the events may be eligible to be submitted as a single public summary, rather than as more than 1,000 individual reports.","media":null},
{"index":27,"date":"Feb-14","title":"Summary Accepted","description":"Medtronic submits a 77-page breakdown of the serious injuries documented in its 2007 internal study. The FDA keeps the table secret, and publishes a single adverse event report that mentions the event is from a larger study. The FDA redacts the injuries total until the Star Tribune successfully challenges it in 2015.","media":null},
{"index":28,"date":"Dec-14","title":"New Guidelines","description":"The North American Spine Society <a href='https://www.spine.org/Documents/PolicyPractice/CoverageRecommendations/rhBMP.pdf' target='_new'>publishes new guidelines</a> for when insurers should cover Infuse, based on a new analysis of available clinical data on Infuse. The guidelines say Infuse should not be used in routine cervical fusion patients.","media":null},
{"index":29,"date":"Apr-16","title":"Paid Article","description":"A decade after Medtronic started its pivotal study of cervical fusion using Infuse and PEEK spacers, a journal article written by paid Medtronic consultants concludes that the study found the procedure was <a href='https://www.researchgate.net/profile/Karen_Anderson10/publication/301736804_Heterotopic_ossification_following_single-level_anterior_cervical_discectomy_and_fusion_Results_from_the_prospective_multicenter_historically_controlled_trial_comparing_allograft_to_an_optimized_dose_/links/57684b0808ae8ec97a4243f7.pdf' target='_new'>“safe and effective”</a> way to do the procedure, according to “unpublished data.”","media":null}]}