{"Sheet1":[{"num":60,"day":59,"last_stop":"Savannah, Ga.","distance":66.3,"total_miles":3114.52,"speed":"","duration":5.5,"terrain":"Dead flat marshes, rivers and forests","weather":"Sticky hot and humid about 90 degrees ","x":32.083541,"y":-81.099834,"cx":32.083541,"cy":-81.099834,"description":"Done!","date":"Monday, May 11","title":"Savannah, Ga.: We have successfully pedaled America","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">W</span>ithout ceremony, except for something akin to a guys' knowing grin, Fifer and I separated Monday afternoon at Waters Street in central Savannah; him to his sister's house, me to stay with friends. And the transition began, back to the warm embrace of our real lives.<p>We would be home today, except that, because our one-way plane tickets had to be booked 10 days ago, we built an extra day in the schedule, just in case. But we're ready: We've found boxes for the bikes, which have now been packed and shipped home. We've alerted our people that we made it, in one basic piece. We have a ride to the airport in the morning. The laundry's done. And we're summing up, what we learned, what we did right, what we did wrong, what we'd do differently, and what, basically, it all means (as much as that is possible at this point, of course). The report on those reflections will be in the Star Tribune's website and Outdoors section next week.<p>\nFor the moment, we have a preliminary final number: 3,114.6. That's the tentative total mileage from San Diego to Savannah, if you go through an amazing coast-to-coast arc of towns across this great nation of ours. Which towns? Glad you asked.<p>\nAlpine, Shamrock, Kayenta, Slidell<br>\nRuston, Chama, Gulf Shores, Idabel<p>\nPampa, in Texas, with oil for big moola<br>\nMarianna, Madison, Borger, Pascagoula<p>\nJacumba, Davis, Ardmore, Bayfield<br>\nDarien, Durant, Congress, Winnfield<p>\nTierra Piedras, with a census about nil<br>\nA couple of \"Jones,\" both a -boro and a –ville<p>\nTaos by the mountains it doth cling<br>\nValdosta, Texarkana, Du Funiak Springs<p>\nBlythe, Tallahassee, Salome, Cortez<br>\nPrescott, Nahunta, New Boston, Natchez<p>\nWaycross, Cimarron, Dumas not that pretty<br>Durango, Bay St. Louis, Hugo, Tuba City<p>\nBiloxi, Quartzsite, Brawley, Magnolia<br>\nEl Centro, Bonifay, Altus, Pensacol-ia<p>\nCrestview, in Florida, is kind of a misnomer<br>\nOh: Two more -villes! A St. Francis- and a Homer-<p>\nSo many towns from which people said, \"We'll see ya!\"<br>\nWe'll forget neither Pass Christian nor Tierra Amarilla!<p>\n\n","photo":"http://stmedia.startribune.com/images/FiferSavannah.jpg","caption":"Will Fifer near the city limits of Savannah, Ga.","video":"null","other_media":"null"},{"num":59,"day":58,"last_stop":"Darien, Ga.","distance":68.7,"total_miles":3048.22,"speed":"","duration":7,"terrain":"To the beach!","weather":"Hot, upper 80s","x":31.370226,"y":-81.43399,"cx":31.370226,"cy":-81.43399,"description":"Transcontinental? Check!","date":"Sunday, May 10","title":"Report from Jekyll Island, Ga.: The bike tour is officially bicoastal","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">A</span>nd so it was, that at roughly 11 a.m. EDT Sunday, Will Fifer and I rolled our front tires into the Atlantic Ocean on Jekyll Island, Ga. — seven weeks and one day, and 3,000-some miles after leaving Dog Beach on the Pacific in San Diego. We rode every inch in between, believe me.<p>\nWe still have to add up the exact mileages, inventory equipment, pack for home, talk about emotions — and continue the ride. For Jekyll Island — a spit of marsh and beach near Brunswick, Ga. — was a detour. Our final destination was always Savannah. But at some point we remembered that Savannah is not actually on the coast; our ride, technically, would not have been coast-to-coast if we just rode into Savannah.<p>\nThat fact inspired some sentiment on the team, as I understand it, that all of the protocols and traditions of the transcontinental bike ride — including the beach-to-beach ceremonies  — should be observed strictly. To ignore those details, the case was made, would be to invite ridicule by even loved ones, and risk the wrath of the gods of cycling — in effect inviting real Old Testament stuff like exploding inner tubes and saddle sores bursting into boils.<p>\nSo we took the 12-mile detour to the beach on Jekyll Island, just in case.<p>\nAnd did not linger. It is hot in Georgia this week, close to 90, and sticky humid. We had 20 miles still to ride to Darien on busy, shoulderless US 17 — a ride, by the way, that at one time would have horrified us and now is merely interesting. It is also true that bike touring, day after day, pack-up after pack-up, map plan after map plan, food and water search after food and water search, can distract you from the romance of any single moment. We pushed off the beach, knocked the sand off our tires, and headed north.<p>\nTomorrow, in Savannah, we'll unpack, look for boxes for shipping our bikes, and begin to process this nutty trip. I'll contribute a wrap up a week from Friday, for the Star Tribune's Outdoors Weekend section and the website. Best and most ridiculous moments. Equipment carnage highlights! Favorite towns. How to ride a bike over snakes! And questions. I'm wondering: Is it more amazing that this ride happened — or that it's over?","photo":"http://stmedia.startribune.com/images/TonyBrownAtlantic.jpg","caption":"The team on Sunday on Jekyll Island, Ga., completing the transcontinental -- but not the ride.","video":"null","other_media":"null"},{"num":58,"day":57,"last_stop":"Nahunta, Ga.","distance":52.8,"total_miles":2979.52,"speed":"","duration":4.5,"terrain":"Flat bayou and scrub pine","weather":"Clear, Hot, humid, in in the mid-80s","x":31.20439,"y":-81.981226,"cx":31.370226,"cy":-81.43399,"description":"More flat bayou and scrub pine","date":"Saturday, May 9","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":57,"day":56,"last_stop":"Homerville, Ga.","distance":78.7,"total_miles":2926.72,"speed":"","duration":7,"terrain":"Flat bayou and scrub pine","weather":"Clear, hot, humid, in the mid-80s","x":31.036598,"y":-82.747085,"cx":31.370226,"cy":-81.43399,"description":"Flat bayou and scrub pine","date":"Friday, May 8","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":56,"day":55,"last_stop":"Madison, Fla.","distance":64,"total_miles":2848.02,"speed":"","duration":6,"terrain":"More of the rolling hills of the panhandle","weather":"Hot, clear, and in the middle 80s","x":30.469377,"y":-83.412925,"cx":30.469377,"cy":-83.412925,"description":"More of the rolling hills of the panhandle","date":"Thursday, May 7","title":"From Florida: Podcast recommendations for the touring cyclist","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">A</span>fter lengthy discussions and extensive research, Fifer and I could find no natural, obvious route from Pensacola northeast through Georgia to Savannah on the coast, and the finish line. So for four days and almost 180 miles we've been sticking to a good thing — US 90 — and just pointing east and riding across the Florida panhandle until we have no choice but to head north.<p>\nNote to bikers: You could do worse than ride 90 across the panhandle. The shoulder, with a few brief exceptions (upon which Fifer always remarks) is good-to-excellent. Nearby I-10 draws off most of the through traffic. And many sections are idyllic — shaded, fragrant corridors of live oaks, magnolias, and huge pines, all interspersed with bogs and grasslands. For someone whose panhandle experience has been concentrated on the coast, this has been news.<p>\nThere's fun, too, in seeing other traveling bikers. This is the corridor of the Adventure Cycling's Southern Tier Route again, and we're seeing other people traveling on bikes every day — our first time since Arizona. And when we stop into cafes for lunch these last few days, we're told of other people on bikes who were just ahead of us. Small thing, but it does bring a smile.<p>\nBut we've still been on the same highway for four days; four days that were preceded by 2,500 miles of other riding. By this I mean we have entered the podcast portion of the ride. The landscape is beautiful, yes, but what are we listening to today? Have you ever tried those two crazy guys behind \"Stuff You Should Know\"? They got me through southeastern Louisiana with their discussion of zero population growth. More complicated than you can imagine. <p>\nHere in Florida, Fifer and I have simultaneously landed on Dan Carlin's Hardcore History podcast, which is like being in a bar with your favorite history teacher. Carlin does go on just a bit, and I'm now finishing the first three installments of his five-part \"Blueprint for Armageddon\" series, which covers the run up to World War I. I'm close to 10 hours in, with two parts to go.<p>\nIt was my hope today to bounce off Fifer several of the bigger questions that Carlin presents. For example, Otto Von Bismarck (1815-1898), the legendary German diplomat. The Kaiser Wilhelm II — no genius, I think we can agree — fired him, either because Bismarck was doddering or just too full of himself. But did Bismarck's classically studied set of interlocking diplomatic agreements delay the start of the world war — or, as a house of cards, virtually create it?<p>\nAnd then there's the Schlieffen Plan — the strategy that sent vast, France-bound German war resources through neutral Belgium, enflaming world opinion and ultimately complicating the start of the war so drastically that Germany never recovered after bold French and British resistance? Or did the German generals undermine the plan by diverting resources at just the wrong time?<p>\nThis is what I wanted to discuss with FIfer. Turns out, natch, he was listening to Carlin's episode on the morality of weapons of mass destruction to reduce casualties in war. OK then.<p>\nInstead, we're laying out the last few days — days that will get us across Georgia, in heat. The forecasts through Monday, our Savannah arrival day, are all in the 90s, in southeastern humidity. We'll be back on our desert water rations for the duration, about 60 or 65 miles each day.<p>\nOh, and I had flat tire #2 today. That's our fifth, as a team. On inspection, my back tire is now quite worn. Should I rotate it? Would it be worth the use of the CO2 carts if we can't find a hand pump? Mundane complications of the traveling cyclist. For four more days, anyway.\n","photo":"http://stmedia.startribune.com/images/PedalingAmFlorida.jpg","caption":"The melons and sweet corn are already in the roadside stands in north Florida. Standing with my bike, I touched an $8 watermelon. John, the farmer, said to me, \"You'd probably better handle a cantaloupe.\"","video":"null","other_media":"null"},{"num":55,"day":54,"last_stop":"Tallahassee, Fla.","distance":63.6,"total_miles":2784.02,"speed":"","duration":6.5,"terrain":"The rolling hills of the panhandle","weather":"Getting hot, humid and well into the 80s","x":30.438256,"y":-84.280733,"cx":30.469377,"cy":-83.412925,"description":"The rolling hills of the panhandle","date":"Wednesday, May 6","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":54,"day":53,"last_stop":"Marianna, Fla.","distance":63,"total_miles":2720.42,"speed":"","duration":5.5,"terrain":"More rolling hills of the panhandle","weather":"Hot, muggy, in the 80s","x":30.77436,"y":-85.226874,"cx":30.721023,"cy":-86.115218,"description":"More rolling hills of the panhandle","date":"Tuesday, May 5","title":"Racing through the Florida Panhandle — we've got a flight to catch","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">O</span>n Monday morning, Fifer and I headed northeast from Pensacola, away from the beach for the first time in three days, with new baggage in our panniers: Reservations for a flight home. We should arrive in Savannah on Monday afternoon — seven weeks and one day since we left San Diego. Given the vagaries of our route through Georgia, and the chance some biblical weather could blow in from the gulf, we've built in an extra day in Savannah for bike packing and beard trimming. So the one-way flight home is Thursday. Imagine that.<p>\nThis schedule reflects a lost day in Alabama. Our hope was to ride from Biloxi last Friday to Dauphin Island, at the bottom of Mobile Bay, camp, and then catch the 8 a.m. ferry Saturday to the other side. That would have put us in Pensacola Saturday night.<p>\nWe made those plans before we were introduced to Dauphin Island, a funky, very relaxed, some would say unfocused little sandbar of a community sticking into the gulf. They pride themselves, we learned, on being a non-tourist place for Alabamans. You want to vacation? You got a schedule? Go to Florida. No franchises. Nothing cute. All the restaurants have pictures off Bear Bryant in them. <p>\nDauphine Island was, in any case, slow to warm to our plans. First, the people at the campground told us they had no space for us. That meant we had to stop 20 miles short of the island Friday night in Bayou La Batre, and ride in early Saturday to catch the second ferry at 9:30 a.m. When we got there, a man in a ferry shirt mentioned, in passing, that the ferry was cancelled after the 8 a.m. run. Until further notice. For unknown reasons. I asked if the ferry is ever canceled for a whole day. He said, \"Oh yeah.\" What, we asked, about that second ferry sitting at the dock? Also not working, he said. His advice: Check the Facebook page or call the information number.<p>\nWe were stuck. It was a full day's ride back around the bay through Mobile. And we could not imagine that this could be a multi-day problem. We walked over to the campground nearby that was supposed to be full — and was the reason we were not on the one run across the bay that morning. Turns out they had not been full. They were not sure how we could have been told otherwise. Oh well.<p>\nWe checked into the campsite — which was in fact populated almost exclusively by people with Alabama plates — and, because we had not become Dauphine people, we regularly checked the Facebook page and called the information number. Neither of which was updated for 24 hours, until 8:30 Sunday morning. By then we'd already cornered the captain on the dock, and knew he hoped to get off at 9:30 or 11. At 9:15 he confirmed the 9:30 departure, and we were on the way off the island, a day late.<p>\nWhich gave us new purpose as we headed across the Florida Panhandle. Over the last two days, from Pensacola, we've covered about 145 miles across a surprisingly hilly and wooded countryside (including a close call with Florida's highest point, at 345 feet, near Crestview). Our next goal: Thee route across Georgia. We have a plane to catch.\n","photo":"http://stmedia.startribune.com/images/Tony+Brown+Florida.jpg.jpg","caption":"You haven't had fun in Florida until you've arrived by bike — from California.","video":"null","other_media":"null"},{"num":53,"day":52,"last_stop":"De Funiak Springs, Fla.","distance":84,"total_miles":2657.42,"speed":"","duration":8,"terrain":"Rolling hills of the panhandle","weather":"Hot, muggy, in the 80s","x":30.721023,"y":-86.115218,"cx":30.721023,"cy":-86.115218,"description":"Rolling hills of the panhandle","date":"Monday, May 4","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":52,"day":51,"last_stop":"Pensacola, Fla.","distance":56,"total_miles":2573.42,"speed":"","duration":5,"terrain":"A beachside run","weather":"Clear, hot","x":30.421309,"y":-87.216915,"cx":30.721023,"cy":-86.115218,"description":"A beachside run","date":"Sunday, May 3","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":51,"day":50,"last_stop":"Dauphin Island, Ala.","distance":22,"total_miles":2517.42,"speed":"","duration":2,"terrain":"Deep bayou","weather":"Clear, in the 70s","x":30.254257,"y":-88.112415,"cx":30.721023,"cy":-86.115218,"description":"Stuck on Dauphin Island","date":"Saturday, May 2","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":50,"day":49,"last_stop":"Bayou La Batre, Ala.","distance":43.5,"total_miles":2495.42,"speed":"","duration":4,"terrain":"Flat bayou forests, with Pascagoula thrown in","weather":"Clear, bright, hottish","x":30.406952,"y":-88.260719,"cx":30.406952,"cy":-88.260719,"description":"A pleasant cruise along the Gulf Coast","date":"Friday, May 1","title":"Cruising the beautiful Gulf Coast","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">A</span>fter leaving Slidell, La., on the north side of Lake Pontchartrain on Thursday, we eventually found ourselves in the middle of a long biking beach binge — a 20-something-mile ride along the Mississippi gulf coast from Bay Saint Louis through Pass Christian, Long Beach, Gulfport and finally Biloxi. We rode the wide, beachside sidewalk the whole way, an unbroken band of blazing white sand, calm ocean and undeveloped waterfront.<p>\nIt was at some point in the middle of the beach ride that your correspondent — to be known henceforth as Mr. Stupid — remarked to Fifer how impressive it was that the good people of these towns had done such a splendid job preserving open space along the ocean and clustering commercial development in discrete junctions along the way. So impressive and enlightened, I said; compared to, say, the endless commercial carnival of the Florida panhandle a ways down the road. Well done, Mississippi!<p>\nThen, again, as a gentleman in Biloxi pointed out, there was also ... Hurricane Katrina. This, we were told, was where the eye hit. And it is now a beautifully and brutally blank piece of shoreline. The debris is gone, of course (we saw just one abandoned, blown-out high rise). The marinas are new; so are the beachside restaurants, many of them on 100-foot towers and stilts. Most of the homes were never rebuilt. Only four Waffle Houses survive, for example. Realtors' For Sale signs on vacant lots are everywhere, after 10 years.<p>\nBut the Mississippi beach does not feel desperate — and, apparently, it doesn't feel that way to live here. We met Mike Foy in Biloxi, an Iowan who lived for many years in the Twin Cities, and is now one of the managers at the city's Palace Casino. Mike's been on the beach here for 14 years; worked to rebuild the casino, hotel and city after Katrina, and loves the place — which, he pointed out, is often no hotter in the summer than Minneapolis. Mike has, he said, happily risked significant bodily harm cheering in public places for the Vikings against the Saints.<p>\nHe'd read about our trip and through a friend, he'd very kindly invited us to dinner on our way through (and also got us a deal on a room at the Palace). He was a generous and informative host with great stories, and Fifer and I will not soon forget the evening, which began with three-dozen oysters and went on from there. We are a couple of grateful bike guys.<p>\nAs we were leaving the Palace Friday morning, heading for Alabama, a woman out front saw us packing up and asked about our ride, and where we were going. We said Savannah. When would we get there, she asked. I then said — for the first time out loud to someone who isn't Fifer — \"We could be there next weekend.\" Indeed, we're planning the endgame, blocking out mileages and even checking flight schedules to MSP. It is all, here on the ocean, as strange and surreal as the approach of the start in California. For tomorrow, we take the ferry across Mobile Bay and ride into Florida, our penultimate state.\n","photo":"http://stmedia.startribune.com/images/Mississippi+Gulf+Coast.jpg","caption":"Riding the beach in Mississippi ...","video":"null","other_media":"null"},{"num":49,"day":48,"last_stop":"Biloxi, Miss.","distance":64.6,"total_miles":2451.92,"speed":"","duration":6,"terrain":"The beach!","weather":"Clear, bright, temperatures toward 80","x":30.396032,"y":-88.885308,"cx":30.406952,"cy":-88.260719,"description":"The beath!","date":"Thursday, April 30","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":48,"day":47,"last_stop":"Slidell, La.","distance":70,"total_miles":2387.32,"speed":"","duration":6.5,"terrain":"Lovely, green cattle and horse country","weather":"Clear and cool, in the 70s","x":30.275195,"y":-89.781175,"cx":30.275195,"cy":-89.781175,"description":"A break from Louisiana drivers","date":"Wednesday, April 29","title":"Our break from battling Louisiana drivers","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">E</span>ven after so much time on the road, still a day of firsts.<p>\nThe first first actually came Tuesday night, when Fifer and I convened the mapping committee to figure out how to get from central Louisiana, southeast to Biloxi, Miss., on the gulf. Unlike most of our ride, we have options — some of them beautiful, some of them stupid and maddening. Louisiana, I should say, has some fabulous riding. The main roads (unlike Mississippi) generally have decent shoulders; you can safely and enjoyably cover some ground. And some of the smaller connecting routes are classic — curving, lightly-travelled corridors of trees that every now and then open up into cinematically green horse and cattle country, accented with white fences and big, prideful farmsteads.<p>\nLouisiana also has, in our experience, a fair number of roads that devolve into stunning, shoulderless frights, on which bikes are completely vulnerable to streams of dough-brained motorists who can't— or won't — bother themselves to move an inch out of their way. Fifer and I agreed ahead of time that we would not make gestures and use epithets toward idiot drivers. That agreement has been suspended.<p>\nIt was in sorting through our Biloxi options on Google Maps that I came upon an odd green line between Covington and Slidell, on the north side of Lake Potchartrain. I zoomed in and — can it be? — it was a bike path, the Tammany Trace, all 31 miles of it, right where we wanted to go. This would be our first bike path of the trip and the first bike infrastructure of any kind we'd seen since a bike lane in Durango, Colo.<p>\nAnd it turned out to be the easiest, most unexpected 31 miles of our trip — a flat, smooth, frost-heave-free ride through forests, swamps and the small towns of Chinchuba, Mandeville and Lacomb. Like Minnesota's Munger Trail, but with pelicans, copperheads, and armadillos. A man who runs an open-air restaurant in Mandeville said he gets traveling cyclists frequently in the spring and fall, and even occasionally in the heat of the summer. He was one of two people we met on the Trace who said, without us asking, that many Louisiana drivers do not acknowledge bikes' right to be on the roads with them.<p>\nOur other first — or my personal first — was my first flat tire, my rear. After 2,000 miles I was privately wondering if I could make the coast without a flat. Then, Wednesday, I rode over a 3/4 inch construction staple that no tire could withstand. The equipment carnage is now: 8 spokes, one fender, a crank set, a tire, four tubes and one tire lever.<p>\nActually, one more first tomorrow. A most generous friend of a friend who lives in Biloxi has been reading the blog. He has kindly invited us out for dinner. Turns out we're free tomorrow evening, and we are humbled, grateful, and eager to walk into a place called The Half Shell Oyster House.<p>\nIn the meantime, we have to find a safe route to get there. I'm thinking: How about along the beach?","photo":"http://stmedia.startribune.com/images/Tammany+Trace+Louisiana.jpg.jpg","caption":"The beautiful and unexpected Tammany Trace bike path in southeastern Louisiana.","video":"null","other_media":"null"},{"num":47,"day":46,"last_stop":"Amite, La.","distance":64,"total_miles":2317.32,"speed":"","duration":5,"terrain":"Rolling, green farm country","weather":"Cloudy, humid, lower 80s","x":30.726575,"y":-90.508982,"cx":30.275195,"cy":-89.781175,"description":"Rolling, green farm country","date":"Tuesday, April 28","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":46,"day":45,"last_stop":"St. Francisville, La.","distance":58,"total_miles":2253.32,"speed":"","duration":6.5,"terrain":"Rolling hills","weather":"A long, soaking rainy day","x":30.788072,"y":-91.376848,"cx":30.275195,"cy":-89.781175,"description":"A long, soaking rainy day","date":"Monday, April 27","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":45,"day":44,"last_stop":"Natchez, Miss.","distance":0,"total_miles":2195.32,"speed":"","duration":0,"terrain":"Mississippi River Bluffs, with fried oysters","weather":"Hot, humid","x":31.560444,"y":-91.403171,"cx":31.560444,"cy":-91.403171,"description":"We've been warned!","date":"Sunday, April 26","title":"Guns, snakes and other dangers on the open road","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">O</span>ur world on the road has been full of many helpful and concerned counselors. Fifer and I are continually told, \"Ride safe!\" or \"Be safe out there.\" At least two people have suggested we carry guns (OK — one of them was the guy who ran the pot-friendly motel in Colorado, and suggested a .45). A Navajo gentleman in Arizona had this advice on riding through Oklahoma: \"Be careful — those are some angry Indians!\" And he made a scalping joke. Just the other day in Arkansas, a man from Virginia asked about our route and said, \"You know you're heading into redneck country. Be careful.\" <p>\nThen, this weekend, new advice. A man we met buying tubes and CO2 cartridges at a bike shop asked about our route and had one word for us: snakes. In Georgia, he said, the snakes — rattlers, mainly — come out on the shoulders of highways late in the day, when the woods begin to cool down and the asphalt is still warm. \"Georgia,\" he said, \"is full of snakes. Watch out.\" Like many of these kind people, he had no specific advice on how one watched out. <p>\nBut at least we're warned. And, after three days off with our wives in lovely old Natchez, Miss., we are also refreshed and even energized. The contrast is profound. We arrived in town Thursday dragging. Mapping bike routes through unknown territory is imprecise work. When we left Pampa, Texas, in the panhandle on April 13, we thought we had built an off-day into the schedule to Natchez. Somewhere in Oklahoma we lost that day, and ended up riding 810 miles over 11 straight days. Six of those days covered between 80 and 96 miles. We were both amazed and appalled by that schedule — kind of encapsulating, really, many of our thoughts about the whole trip.<p>\nNow, full of lemon pepper catfish and oyster pasta with truffle cream, we head for the gulf, with an attitude that, by comparison, approaches a sense of holiday. We have what appear — appear! — to be about a dozen reasonable riding days between Natchez and the Georgia coast. Throw in a few off days, and we're a couple of weeks from the Atlantic, assuming no crazy weather blows in off the gulf. The coast is set up for travelers, something that cannot be said about much of the last 800 miles. And Fifer's new tire arrived Friday. And we set off Monday for four 60-something-mile rides to the beach at Biloxi, from which one can just about see Florida.<p>\nAlso, tomorrow, for the first time since western Arizona near the Grand Canyon, we rejoin a route mapped by the Adventure Cycling Association. We expect, even hope, to see other travelers on bikes. We have not seen anyone else traveling on bikes for five weeks.<p>\nWe will at the same time be on the lookout for ... those other things about which we are supposed to be watchful. \n","photo":"http://stmedia.startribune.com/images/TonyBrownMississippi.jpg","caption":"Crossing the Mississippi River into Natchez, Miss., came after 11 straight days of riding more than 800 miles.","video":"null","other_media":"null"},{"num":44,"day":43,"last_stop":"Natchez, Miss.","distance":0,"total_miles":2195.32,"speed":"","duration":0,"terrain":"Mississippi River Bluffs, with fried oysters","weather":"Hot, humid","x":31.560444,"y":-91.403171,"cx":31.560444,"cy":-91.403171,"description":"Mississippi River Bluffs, with fried oysters","date":"Saturday, April 25","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":43,"day":42,"last_stop":"Natchez, Miss.","distance":0,"total_miles":2195.32,"speed":"","duration":0,"terrain":"Mississippi River Bluffs, with fried oysters","weather":"Hot, humid","x":31.560444,"y":-91.403171,"cx":31.560444,"cy":-91.403171,"description":"Mississippi River Bluffs, with fried oysters","date":"Friday, April 24","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":42,"day":41,"last_stop":"Natchez, Miss.","distance":96.5,"total_miles":2195.32,"speed":"","duration":9,"terrain":"Rolling hills, with lots of logging trucks and loose dogs","weather":"Warm, humid","x":31.560444,"y":-91.403171,"cx":31.560444,"cy":-91.403171,"description":"Rolling hills, with lots of logging trucks and loose dogs","date":"Thursday, April 23","title":"Cleaned up and ready for a romantic weekend","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">S</span>o everyone can relax, I  found a barber. He was Max Smith of Max's Barber Shop in Winnfield, La. On a shortish day Wednesday, we got into to Winnfield (pop. 4,600) from Ruston, La., with enough time for me to clean up and head for what I was told were two barber shops on Main Street.<p>\nMax — 71, with a wry side-long glance and comfort working in silence around customers — was in the middle of what looked like a busy day. The other barber two blocks away, City Barber, was closed (a hand-lettered sign taped inside the front window read, \"Sick.\") So Max had the town to himself. When I got there a little after 4, two guys were ahead of me, reading Outdoor Life contentedly; and, shortly after I sat down a woman arrived with two pre-teen boys. But Max had already told me his policy: He closes at 5, but anybody who comes through the front door before that gets a haircut.<p>\nIt's a one-chair place with linoleum floors, charts of model haircuts you can point to, and firing range target sheets leaning in one of the chairs (with a number of close bullseyes). I had about 12 minutes with Max that did not seem rushed. (\"Would you like a regular haircut?\" \"Sure, just kind of clean me up, that would be fine.\") He asked about my bike, propped against the front window; I asked about Winnfield. What should people know about the town? Max had three ideas: First, three Louisiana governors grew up here – including, amazingly, Huey P. Long, the Kingfish, the man who was a populist national political figure in the 1930s and challenged FDR for the presidency in 1932. He was assassinated in 1935. In the original film about Long he was played by Broderick Crawford; Sean Penn played him in the remake. I was sitting in the barbershop in Huey Long's town in central Louisiana. <p>\nMax also mentioned that people should know that Winnfield is a wood products town, and has been forever; and that the deer hunting used to be better before the pulp companies restricted so much access to the good and open lands around town. One of the guys sitting nearby nodded. I paid my $12 (actually, I gave Max a $20 bill and asked for $5 back) and noticed that yet another man had come in, just ahead of 5 p.m., to follow the kids. He'd be getting a haircut, no problem.<p>\nI said thanks. Max said, as everyone does, \"Be safe out there.\" He added, \"Watch out for the logging trucks. They won't know what to make of you.\"<p>\nNow, 97 miles later (thanks in part to an annoying detour) we're in Natchez, across the Mississippi River again, for our first days off the bikes in 10 days. And our wives arrive on Friday for the weekend. This should be different.\n","photo":"http://stmedia.startribune.com/images/Maxs.jpg","caption":"Wednesday was haircut day at Max's in Winnfield, La., with the ghost of Huey Long.","video":"null","other_media":"null"},{"num":41,"day":40,"last_stop":"Winnfield, La.","distance":46.9,"total_miles":2098.82,"speed":"","duration":4,"terrain":"Rolling hills down to the southern Mississippi Valley","weather":"","x":31.925441,"y":-92.639593,"cx":31.560444,"cy":-91.403171,"description":"Rolling hills down to the southern Mississippi Valley","date":"Wednesday, April 22","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":40,"day":39,"last_stop":"Ruston, La.","distance":75.9,"total_miles":2051.92,"speed":"","duration":9,"terrain":"Another new state, with mechanical mysteries","weather":"Cold, rainy","x":32.523205,"y":-92.637927,"cx":32.523205,"cy":-92.637927,"description":"Another new state, with mechanical mysteries","date":"Tuesday, April 21","title":"In Louisiana, the case of the cursed rear wheel","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">W</span>e started the day Tuesday with five tires, four spare tubes, and five CO2 cartridges. We ended the day with four tires (that is, those on the bikes), one spare tube and two cartridges — and a mystery.<p>\nFor weeks, Fifer's rear tire has been an annoyance. It would be stable. It would go soft. It would be stable again. Then it popped a bulge — a tire aneurysm — which itself then disappeared. Within minutes. Mid-morning Tuesday the tire was soft again, and he had enough. It was time for a second tube change of the trip. But in the installation, bad news: The sidewall was torn, the tire essentially toast. That was in Haynesville, La., about 20 miles into our 75-mile day.<p>\nWe've been carrying a foldable spare, which then came out of the bottom of a pannier. While Fifer installed that one, I called a bike shop in Natchez, Miss., our weekend stop, to order a new spare tire, to be picked up Saturday. We'd be covered. Annoyance over.<p>\nWe headed off into Claiborne, then Lincoln, parishes in northern Louisiana; dense, hilly oak and pine forests. The guys at a gas station diverted us from our planned route, which they said was under construction, and sent us cross country on beautiful, lightly traveled, shoulder-less roads through tiny towns and small farms cut out of the trees. The houses here are built close to the road; people wave at you from their porches. An unexpected little adventure until, at about 50 miles, Fifer said: \"It's going flat.\" The rear tire, that is. The one with a new tube and a new tire. <p>\nIf we were stumped how a new tube and tire could go flat, we were dumbfounded when the second new tube didn't hold air either. That was the third tube in Fifer's rear wheel that day. We stood, looking at each other, standing in a farm field, baffled. Did I mention it was also raining? After taking the wheel apart again, checking the rim for flaws (none) and the tire holes or shards of rock or glass (none), we had one stupid theory: We'd bought two bad tubes. Which meant we needed to try a third, the third of our four tubes.<p>\nThe third tube held with the new tire. Wary elation. We packed up and made it into busy and prosperous Ruston, home to Louisiana Tech and just down the road from Grambling, just before 7 p.m., losing light fast and riding ahead of more rain. We will try to find tubes and CO2 carts on the way out of town tomorrow. If we can't, we'll hope for the best until Friday in Natchez. And hope the curse on Fifer's wheel was exorcized in the rain. Watching two new tubes go flat, in the rain, 20 miles from your destination, is a lousy way to finish an afternoon.<p>\nFor tomorrow, the team has enthusiastically embraced Fifer's suggestion to camp in the Kisatchie National Forest as we head for Mississippi.<p>\nFor the record, the equipment carnage so far: 8 spokes, a front fender, a crank set, a tire, 3 tubes, and a tire lever.\n","photo":"http://stmedia.startribune.com/images/Louisiana.jpg","caption":"Our first day in Louisiana included too much time with a cursed rear wheel.","video":"null","other_media":"null"},{"num":39,"day":38,"last_stop":"Magnolia, Ark.","distance":79.6,"total_miles":1976.02,"speed":"","duration":7,"terrain":"A pedaling introduction to a beautiful state","weather":"Clear and cool","x":33.267072,"y":-93.239334,"cx":32.523205,"cy":-92.637927,"description":"A pedaling introduction to a beautiful state","date":"Monday, April 20","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":38,"day":37,"last_stop":"New Boston, Texas","distance":90.4,"total_miles":1896.42,"speed":"","duration":7.5,"terrain":"A lovely day to cross the Red River Valley","weather":"Warm, toward the lower 80s","x":33.459842,"y":-94.415479,"cx":33.459842,"cy":-94.415479,"description":"A lovely day to cross the Red River Valley","date":"Sunday, April 19","title":"Making way for Mississippi","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">F</span>ifer today was reminded of a book he once read about a mountain bike race along the continental divide. The book's called, \"Eat, Sleep, Ride.\"<p>\nWe're in a bit of a cruise here, making time to get to and across Louisiana this week, to meet our wives in Natchez, Miss., Friday night. No problem. But we just have to keep moving. We've made about 230 miles over the last three days across green, tree-lined roads that could be in central Minnesota. Which makes the mileage both comforting and unmemorable. These last towns — Madill, Hugo, New Boston — are small towns away from large ones. Other than the satisfaction of the mileage and seeing the country, we take our thrills where we can get them: Saturday we officially set a new low for motel rates ($39 for the #1 rated Trip Advisor motel) and we ate at one of the chanciest of all on-the-road dining options (Chinese, small town in Oklahoma, broken-down, nearly unreadable sign, one car in the lot, and no mentions on any online rating sites — but it was walkable) and survived with G.I. tracts unperturbed. <p>\nMore to the point, we're back in Texas. If only briefly. We are all about heading southeast right now, and catching the corner of Texas near Texarkana made the most sense. These parts have none of the desperation, or the wind, of the panhandle. But also, again — strange to say—  none of the exotic edge of the raw high plains. We'll ride now into the Deep South, across Louisiana to Natchez by Thursday night. Exotic edge? We think we'll be getting it back.<p>\nI ride with a nagging grooming challenge. Other than showering, we have been relaxed on cleaning up. (Not long ago a young woman we met said, \"I hope when I have my gray hair, I ride like you guys, too.\" I thought: I have a helmet on. How could she ... then I remembered our beards. We both have gray beards.) But I've been trying to get a haircut for two weeks. Our last rest day was a Sunday. And we usually arrive too late in the day for the local barber shops. Then Friday, the motel in Madill recommended Michele's, which will cut men's hair, they said. Michele said she was booked up, even when I played the in-town-for-one-day-on-a-bike-trip card. Saturday, we pull into Hugo, Okla., at about 4 p.m., and I see that Ralph's Barbershop is open until 6 — but closed on Saturdays! A barber closed on Saturdays. Where else could this happen. I'm guessing, hoping, not in Louisiana.\n","photo":"http://stmedia.startribune.com/images/red_river.jpg","caption":"We crossed into Texas again — but this time we're headed for Louisiana, not Oklahoma.","video":"null","other_media":"null"},{"num":37,"day":36,"last_stop":"Hugo Okla.","distance":80.6,"total_miles":1806.02,"speed":"","duration":7,"terrain":"Comfortable cruise across hilly southern Oklahoma","weather":"Cool, breezy, threatening rain that never appears","x":34.01066,"y":-95.509682,"cx":33.459842,"cy":-94.415479,"description":"Comfortable cruise across hilly southern Oklahoma","date":"Saturday, April 18","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":36,"day":35,"last_stop":"Madill, Okla.","distance":52.6,"total_miles":1725.42,"speed":"","duration":5,"terrain":"Curvy roads!","weather":"Cool and rainy","x":34.090375,"y":-96.771669,"cx":34.090375,"cy":-96.771669,"description":"Curvy roads!","date":"Friday, April 17","title":"Oklahoma: A happy place for touring cyclists","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">T</span>his is new: We are now riding along curving highways surrounded by green trees. And today — a lake! Actually a reservoir, Lake Texahoma, a resort region we stumbled into along the Oklahoma-Texas border. They claim this is the 12th largest lake in the country. People are pulling boats around here.<p>\nThis is part of our Oklahoma discoveries. This morning — the Arbuckle Mountains, a slightly aspirationallly named but lovely situated hill country of central Oklahoma. Small resorts. Clear streams. Unexpected. Nice traveling.<p>\nEverything's wetter, including the riding. Rain's been a part of most days. We're having to wipe down, clean and lube the bikes more. And watch the weather. Tornados are dancing around and inside Oklahoma this week, with touchdowns in towns we rode through a few days back. It certainly animates the morning planning.<p>\nWe've settled into a sequence of long days (80-plus miles) and standard days (50-ish miles) to maintain pace and still get our rest, in this intense life that is bicycle touring. We've reverted to the lives of 15-year-olds, actually — we eat a lot; we sleep for long, uninterrupted time; and we go hours communicating with grunts and gestures. Ah, the touring life.","photo":"http://stmedia.startribune.com/images/35W.jpg","caption":"We just crossed I-35 — a landmark and an echo of home.","video":"null","other_media":"null"},{"num":35,"day":34,"last_stop":"Davis, Okla.","distance":82,"total_miles":1672.82,"speed":"","duration":8.5,"terrain":"Windy, tough riding","weather":"Windy, cool","x":34.504532,"y":-97.119464,"cx":34.090375,"cy":-96.771669,"description":"Springtime on the southern prairie","date":"Thursday, April 16","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":34,"day":33,"last_stop":"Lawton, Okla.","distance":58.8,"total_miles":1590.82,"speed":"","duration":5.5,"terrain":"Our first cruise in a while","weather":"Cool, gentle breezes in the 60s","x":34.603567,"y":-98.395929,"cx":34.603567,"cy":-98.395929,"description":"The bustling small towns of Oklahoma","date":"Wednesday, April 15","title":"Oklahoma lifts our spirits — and our leg muscles","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">T</span>he first definitive moment of our new world was on arrival in Altus, Okla., about 40 miles in from the Texas line. Altus, we found, was an actual town. It had a town square. It had bustle. Almost all of the buildings appeared to be occupied. I saw people walking. Got a wave from a woman standing on the curb.<p>\nAltus was, really, the first real town we've seen in about 470 miles, since Taos, NM. By that, I mean all of the towns in between — all the towns — were at least half abandoned, if not mostly. This is not an exaggeration. Since Taos, it has been unusual to arrive in a town and see two operating businesses next to each other. We have seen many more vacant blocks than occupied ones. The entire south half of Pampa, Texas (pop. 18,400) was an abandoned shambles. In McLean, Texas, on old Route 66, there were scores and scores of abandoned buildings, including the movie theater, with just the cafe still open. The panhandle is desperate country that makes for a sociologically compelling, if emotionally draining, ride on a bike.<p>\nBut, with Altus, we only knew the half of our Oklahoma welcome. Heading east on Wednesday morning on OK 62, the main east-west highway in the south of the state, we found ourselves surrounded by vast, emerald green fields of knee-high spring wheat; then fields with the yellow flowers of canola. With big rocky hills, it looked to Fifer and me like Ireland. Then we took the business loop off OK 62 into Snyder, Okla. (pop. 1,300) looking for lunch. We found a kind of slightly sun-burned Mayberry, with pedestrians downtown, a sparkling high school on the main street, and some smart-guy residents. The two guys out front of the hardware store told us to go to Mel's Diner for lunch; they said, oh yeah, to ask for Lucy, and \"tell her she owes us money.\" We asked about Lucy, passed along the message, and our waitress laughed and said of the hardware guys, \"They say everybody owes them money.\" We felt a small part of the town.<p>\nThen we came to Lawton, Okla., at 91,000 people, the largest city we've ridden into since San Diego. Traffic!<p>\nThis new world has, frankly, raised our sprits for the week ahead. Neither of us had much experience with Oklahoma, and we had spoken of our fear that we would get more of the same — a flat, dry landscape of hollowed towns. Apparently not. We've also moved past 1,500 miles, the original approximate half-way point. We think we're actually farther than that. We shaved a lot of miles off the route by cutting across the Texas Panhandle, and with our rendezvous in Natchez, Miss., we've now decided to divert from New Orleans, just heading east from Baton Rouge to Mobile, Ala., and the Gulf Coast. <p>\nWe did take a small treasure from Texas. Fifer and I have a stop-at-all-historic-markers policy, which has been only intermittently rewarded. One of those rewards was just south of Wellington, Texas, where Texas 83 crosses the Salt Fork of the Red River. The marker there reported that it was here, in 1933, that Bonnie & Clyde missed a detour sign, and plunged into the dry riverbed. Bonnie was badly burned by battery acid in the wreck, they shot one of the people who came to their rescue, and it was one of the last ignoble incidents before they died weeks later in Louisiana. Not much has changed about that spot in 80 years; kind of tingly to stand there. As I said, small treasure.\n","photo":"http://stmedia.startribune.com/images/TonyBrownTexas.jpg","caption":"A scene from McLean, Texas: the Panhandle was filled with deserted downtowns.","video":"null","other_media":"null"},{"num":33,"day":32,"last_stop":"Altus, Okla.","distance":92.6,"total_miles":1532.02,"speed":"","duration":9,"terrain":"Oklahoma!","weather":"Cool and wet","x":34.637765,"y":-99.334044,"cx":34.603567,"cy":-98.395929,"description":"Oklahoma!","date":"Tuesday, April 14","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":32,"day":31,"last_stop":"Shamrock, Texas","distance":58.07,"total_miles":1439.42,"speed":"","duration":6,"terrain":"Our tour of Texas comes to a close","weather":"Cold and blustery","x":35.214217,"y":-100.249008,"cx":34.603567,"cy":-98.395929,"description":"Our tour of Texas comes to a close","date":"Monday, April 13","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":31,"day":30,"last_stop":"Pampa, Texas","distance":0,"total_miles":1381.35,"speed":"","duration":0,"terrain":"Hot tub","weather":"Hot, windy","x":35.536156,"y":-100.959871,"cx":35.536156,"cy":-100.959871,"description":"Day off","date":"Sunday, April 12","title":"Thank you, Texas!","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">T</span>hank you Texas, for Texas Toast and that famous Texas attitude. So before we head toward Oklahoma, just a bit of our gratitude.<p>\nThank you Texas for vicious winds pelting us each day with your topsoil. And those fumes you vent from pumpjacks, a suckin' up all that oil.<p>\nThank you Texas for the unfathomable ceaselessness of your vast empty land. The bleak endlessness that drains all life from every sinew, fiber and gland.<p>\nThank you Texas for your courtesies, your manners we're told are iconic. Like the guy idling and revving his diesel truck next to our picnic table at Sonic.<p>\nThank you Texas for the memories, and all the distinct feelings they engender. Will our time with you be unforgettable? Or will we just not remember?<p>\n......<p>\nMany expanses of America lack memorable features, or obvious qualities that redeem them on extended exposure of the through traveler. The very special and perhaps singular opportunity in the Texas Panhandle (and to some degree northeastern New Mexico) is to ride a bicycle almost 250 miles over three days through winds of 25-40 mph, and be given no memory or evocative experience to take with you. Notable and amazing.<p>\nThis is not the sort of ride you'd take unless you were headed somewhere else, which we are. On Monday. Saturday, the shortest of our last three days at 71 miles, was just a delightful slog directly into a relentless 25-35 mph wind. With stops, it took us almost 11 hours to get from Dumas to Pampa, just ahead of a thunder storm. Fifer and I kinda stopped talking after about the eighth hour, and just got on with it.<p>\nBut we've moved on. In fact, we ride Monday morning with a new plan. As we approach the ride's midpoint, we've been running dates and mileages to book a rendezvous with our wives, Josephine and Liz, in a few weeks. The idea was: New Orleans. And the mileages work — we could be in New Orleans in two weeks, right in the middle of the Jazz and Heritage Festival. That's apparently perfect, except that flights and hotels (those that are even available) are shockingly expensive.<p>\nThe inspired new idea: A weekend in loverly, historic Natchez, Miss., said to be the oldest town on the river. Hoping the azaleas will still be in bloom. Fifer and I are, as a result, skipping New Orleans all together. From Natchez we'll drop down to the Gulf Coast, turn east, and head for Georgia. That, anyway, is how things look today from Pampa, Texas. What will Oklahoma bring?\n","photo":"http://stmedia.startribune.com/images/2015-04-10+09.21.34.jpg","caption":"Hi ... From the wind-battered roads of the Texas Panhandle.","video":"null","other_media":"null"},{"num":30,"day":29,"last_stop":"Pampa, Texas","distance":71.74,"total_miles":1381.35,"speed":"","duration":9.5,"terrain":"A long slog into a blasting wind","weather":"Cool, windy","x":35.536156,"y":-100.959871,"cx":35.536156,"cy":-100.959871,"description":"A long slog into a blasting wind","date":"Saturday, April 11","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":29,"day":28,"last_stop":"Dumas Texas","distance":85.42,"total_miles":1309.61,"speed":"","duration":7.5,"terrain":"Flat and rolling","weather":"Cool, clear, windy; the sky a wispy basketweave of contrails","x":35.865379,"y":-101.973224,"cx":35.536156,"cy":-100.959871,"description":"Keep on rolling","date":"Friday, April 10","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":28,"day":27,"last_stop":"Clayton, N.M.","distance":84.16,"total_miles":1224.19,"speed":"","duration":7.5,"terrain":"Rolling hills","weather":"Windy and cool","x":36.451693,"y":-103.184104,"cx":35.536156,"cy":-100.959871,"description":"Rolling, rolling, rolling","date":"Thursday, April 9","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":27,"day":26,"last_stop":"Springer, N.M.","distance":25.7,"total_miles":1140.03,"speed":"","duration":2,"terrain":"A brisk cruise across the plains","weather":"Clear, wildly windy up to 40 mph","x":36.361145,"y":-104.595267,"cx":36.407249,"cy":-105.573066,"description":"A brisk cruise across the plains","date":"Wednesday, April 8","title":"Open roads, gusting winds: A new set of challenges in the Great Plains","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">A</span>t approximately 11 a.m. MDT on Tuesday, at 9,101 feet — 2,000 feet above breakfast in Taos — we cleared Palo Flechado Pass, the last pass in the eastern New Mexico mountains, and shifted gears to head down into the plains. Following the Cimarron River, we hit an 8,000-foot high plateau at the town of Eagle Nest; then turned into the river's deep canyon and followed the winding river downhill on a lightly traveled Hwy. 64. We glided for 18 miles on about a half-percent grade, almost without pushing a pedal. At 6,800 feet, a marker noted the official geographical boundary of the Rocky Mountains and the Great Plains. Fifer said, \"This might be one of those memorable days.\"<p>\nFive miles later we blew into tiny, struggling Cimarron, N.M. From the middle of town, you look west into green, rocky mountains still full of snow; look east and it is flat and brown, and it seems you can see clear to the Texas and Oklahoma panhandles, now just 100 miles away.<p>\nAt the Cimarron Inn and RV Park, we met ebullient proprietor Deborah Sanders, and her enormous Irish Wolf Hound, Pork Chop. She said she gets traveling cyclists through \"all the time\" for the same reasons we came: A grand landscape worth the work it demands of you. Later this month, she said, 50 Armenian bikers are booked to stay at the Inn on their way from Los Angeles to Washington, D.C. Then she turned serious. She asked which way we were headed. East, we said. \"Well,\" Deborah said, her smile gone, \"then the beautiful part of your ride just ended.\"<p>\nIt's a new day, certainly. On a bike, the winds are the mountains of the Great Plains. Wednesday, they gusted to 40 mph out of the WSW, mostly in our favor heading eastward on a short 25-mile move from Cimarron to Springer, N.M. (On a brief southbound stretch across the wind we were occasionally pelted with flying balls of sage that shredded in our spokes and gears; Fifer's still cleaning sticks from his rear cassette.) We hope today will set up Thursday's 85-mile ride to Clayton, just short of the Texas-Oklahoma lines. Once again, we're told there are no resources between here and Clayton. We'll be packed up. And the wind's supposed to turn an unhelpful NNE on Thursday, hitting us broadside with gusts up to 25 mph. We'll try an early start for sure.<p>\nBy the way, Fifer and I have decided to cut diagonally across the Texas panhandle above Amarillo to get to Oklahoma. Today, from Springer, NM, it seems like the right thing to do.<p>\n****<p>\nSome other notes on the trip so far:<p>\nThe two forced nights we spent out in the open over the last 10 days has dissolved the sharper edges of what had been one of the few shards of tension on the trip. The issue was camping. We've discussed and made decisions on a thousand issues. Somehow, we hadn't spoken in advance in detail about our expectations about camping. I viewed my light sleeping bag and bivy sack as one would view a spare tire in a car. If after a trip you hadn't used it: good. Fifer's been saying such things as, \"It would be a shame if we brought this stuff and didn't use it.\" He's been pointing out potential campsites along the way, even in the most barren sections of scorpion-infested desert. I mostly ignored him. Since the forced bivouacs in Arizona and New Mexico, he's quieted down considerably. When I heard him say something the other day about \"state parks in Arkansas,\" I ignored that, too.<p>\n****<p>\nOur search for unique, smaller motels led us to the First Inn in Pagosa Springs, Colo. On arriving, Fifer mentioned to the unfocused man behind the front desk that it was good to see on the sign out front that the motel was \"friendly.\" The man looked up. \"That's 4-20 friendly,\" he said. \"If you want to take advantage of that, you'll have to be on the second floor.\"<p>\nAh: 4-20 Friendly. Colorado. This place lets you smoke pot in your room. We stayed on the first floor. After a brief pause.\n<p>******<p>\nFifer and I were ejected from the Visitors Center at the Rio Grand Gorge west of Taos earlier this week. We had stopped there at the publicly-funded facility for water and the bathroom. When we came out of the public bathroom, a man with an official vest said, \"No bicycles. You have to leave.\" We said, \"Why?\" He said, \"It's the regulation.\" No use in arguing. We left, laughing. But honked off. Fifer's research found that the center was managed by the federal Bureau of Land Management — and the regional office was a mile from our motel in Taos. On our day off, we walked there, eager for a constructive discussion of public policy. But a helpful man in the regional headquarters said the BLM website is inaccurate; the center is actually managed by the New Mexico DOT. Next steps, TBD.\n","photo":"http://stmedia.startribune.com/images/GreatPlains.jpg\n","caption":"A strong wind at their backs, Brown and Fifer went sailing into the Great Plains.","video":"null","other_media":"null"},{"num":26,"day":25,"last_stop":"Cimarron, N.M.","distance":55.6,"total_miles":1114.33,"speed":"","duration":6,"terrain":"Big transition, over the pass into the plains.","weather":"Clear, windy, cool","x":36.510869,"y":-104.915834,"cx":36.407249,"cy":-105.573066,"description":"Big transition, over the pass into the plains.","date":"Tuesday, April 7","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":25,"day":24,"last_stop":"Taos, N.M.","distance":0,"total_miles":1058.73,"speed":"","duration":0,"terrain":"Spent 20 minutes on the bike, running errands","weather":"Clear, windy, in the 60s","x":36.407249,"y":-105.573066,"cx":36.407249,"cy":-105.573066,"description":"Spent 20 minutes on the bike, running errands","date":"Monday, April 6","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":24,"day":23,"last_stop":"Taos, N.M.","distance":37.8,"total_miles":1058.73,"speed":"","duration":3.5,"terrain":"A beautiful downhill ride from the mountains into high sagebrush ranching country","weather":"Clear, windy, temps from 37 to 78","x":36.407249,"y":-105.573066,"cx":36.407249,"cy":-105.573066,"description":"A beautiful downhill ride from the mountains into high sagebrush ranching country","date":"Sunday, April 5","title":"Surprise! The 10,000-foot climb we never noticed on our maps","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">S</span>o, funny story. Saturday was supposed to be our tactical day, in getting from Chama, N.M., to Taos, N.M. We knew we couldn't make the whole 95 miles in one day, so we planned to cover as much mileage as possible and then — because the land is virtually vacant of people the whole way — pull over and camp somewhere in the Carson National Forest.<p>\nPeople in Chama — a number of them — looked at us in bike helmets and simply told us it was a beautiful highway to Taos. We'd scanned the highway map and looked at Google Maps' Street View all over the place. But no one and nothing, no how, told us about the 10,300-foot pass along the way.<p>\nWe started at 7,800 feet, and soon became the cyclists who walked their way across northern New Mexico, mile after unexpected mile pushing our packed bikes up a 3 percent grade. It took us five hours to cover the first 25 miles. At 9,000 feet we were perplexed; at 10,000, Fifer was looking around for Rod Serling. They are still snowmobiling at 10,000 feet here in New Mexico. The Historical Markers still have five feet of snow in the parking lots. We assumed those folks in the diner back in Chama were having a good laugh over their cups of coffee.<p>\nWe were confused, and a little exhausted, but also antsy. We were at the top after 3 p.m., and didn't know what we'd find in the descent. But no matter what, we'd have to get to 8,000 feet while we still had light, to camp. We were barely prepared for spring camping, certainly not winter camping. So we, two determined guys, rode down, and some up, for the next hour and a half and made it down to 8,200 feet, where we pulled into a National Forest access trail, and plopped.<p>\nHow had we messed that up? First, a note about the value of \"local knowledge.\" It is over-rated. We have spoken to people in Colorado, multiple people, who told us a highway was \"pretty flat,\" and found ourselves riding up 1,800 feet during the day. The people — again, multiple people — in Chama live a half-hour drive from a 10,000-foot peak, and they looked at someone on a bicycle and forgot to mention it.<p>\nOh, and we spoke to four or five people between Pagosa Springs, Colo., and Chama —  including two motel managers  —  and they all said was there are no restaurants or accommodations between Chama and Taos. Sunday morning, five miles after breaking our Saturday night campsite, we came upon a cafe and lodge in the village of Tres Piedras. They make their own pies. Would have been good to know. The women who ran the place warned us that there would be tourists in Taos. I pointed out that, technically, we would be tourists, too. She said, \"Not if you ride in on a bike!\"<p>\nI also could have been part of the problem. I'd found a colorful and waterproof highway map of Colorado that also included the northern third of New Mexico  — our route on one map, I thought. But I notice now that passes are noted on the Colorado section, but not in New Mexico. Nice move.<p>\nOK, but did I mention that in the last few days we have now ridden (and walked a little) through your basic western wonderland? We are trying, when we stop, to say the words out loud: Look at that — the mountains, the vistas, the grand spectacle of it all. Quite a thing to glide through on a bike, on clear spring days, headed for Taos with a thousand miles behind you; looking ahead, yes, but with still many thoughts of home.","photo":"http://stmedia.startribune.com/images/NewMexico.jpg","caption":"Fifer took a break to loosen up during a 10,000-foot climb in New Mexico.","video":"null","other_media":"null"},{"num":23,"day":22,"last_stop":"Somewhere in the Carson National Forrest of New Mexico","distance":56.5,"total_miles":1020.93,"speed":"","duration":7.5,"terrain":"An unexpected climb over 10,000 feet","weather":"Clear, windy and cold","x":36.50526,"y":36.50526,"cx":36.407249,"cy":-105.573066,"description":"","date":"Saturday, April 4","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":22,"day":21,"last_stop":"Chama, N.M.","distance":50.86,"total_miles":964.43,"speed":"","duration":6,"terrain":"Beautiful cold-to-cool Rocky Mountain day of peaks, rushing streams and elk bounding across the asphalt in front of us","weather":"Blue sky, starting in the 30s, averaging in the 50s","x":36.903068,"y":-106.579479,"cx":36.407249,"cy":-105.573066,"description":"Beautiful cold-to-cool Rocky Mountain day of peaks, rushing streams and elk bounding across the asphalt in front of us","date":"Friday, April 3","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":21,"day":20,"last_stop":"Pagosa Springs, Colo.","distance":61.32,"total_miles":913.57,"speed":"","duration":6.5,"terrain":"An odd up and down day with with wildly blustery winds","weather":"Cloudy in the 50s","x":37.26945,"y":-107.009762,"cx":37.348883,"cy":-108.585927,"description":"Hearts and minds on the plains","date":"Thursday, April 2","title":"Southern Colorado: A maze of iffy options for touring cyclists","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">F</span>riday morning we head south from Colorado for New Mexico, trying to get out of the mountains. We know the route, just not what will happen along the way.<p>\nSince Fifer and I limped into Cortez, Colo., 105 miles ago, we have ridden a lovely survey of the state's ranch country, through Durango and now to Pagosa Springs. Fifer has a new crank set on his bike (and survived the trip's first flat tire).<p>\nOur main concern is how to get from here to Taos, N.M., which is our last goal before we ride over the last of the mountains and move onto the plains. The mountains, duh, have been a drain — not just the climbing, but the continual climbing and descending in cool temperatures, changing jackets continually, and never quite finding a pace.<p>\nHeading south here is really our only option at this point. If we stay on Colorado 160, we'd face a 10,500-foot pass. If we had turned south earlier, the roads would have had even less of a shoulder than the ones we'll be on. When we ask people in bike shops these last few days about routes, no one has any suggestions: For cross-country biking in southern Colorado, they said there is no best option. This might, again, be why we haven't seen another touring cyclist for 10 days.<p>\nNow we have the trip's second day of unknown ahead of us. It is 145 miles from Pagosa Springs to Taos. It is 50 miles from here to Chama, N.M., an intermediate town of some size that is a natural stop. In the 95 miles from there to Taos, we can't find any accommodations — not even a seasonally closed campground. And, given the mountains and our burdened bikes, we are unlikely to make the 95 miles in one day. So we'll head out Saturday, like last weekend on the Navajo reservation, not knowing where the day will end. We'll pack extra supplies.<p>\nWe'll be inspired by the fact that, once we get to Taos, one way or another later this weekend, we'll be about a 1,000 miles into the trip, with no deserts or mountains ahead of us. Tornado Alley? Bring it on.\n","photo":"http://stmedia.startribune.com/images/southerncolorado.jpg","caption":"Brown and Fifer are ready for the plains. The mountains have been beautiful, but tough.","video":"null","other_media":"null"},{"num":20,"day":19,"last_stop":"Durango, Colo.","distance":45,"total_miles":852.25,"speed":"","duration":4.5,"terrain":"Climbing and coasting; gained 3,087 feet, dropped 2,694 feet in the Rockies","weather":"Windy, partly cloudy in the 60s","x":37.27528,"y":-107.880067,"cx":37.348883,"cy":-108.585927,"description":"A day of climbing and coasting","date":"Wednesday, April 1","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":19,"day":18,"last_stop":"Cortez, Colo.","distance":0,"total_miles":807.25,"speed":"","duration":0,"terrain":"Off day","weather":"Clear in the mid 60s","x":37.348883,"y":-108.585927,"cx":37.348883,"cy":-108.585927,"description":"Combination rest, tasks, and bike repair","date":"Tuesday, March 31","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":18,"day":17,"last_stop":"Cortez, Colo.","distance":45,"total_miles":807.25,"speed":"","duration":4,"terrain":"A shorter day, leaving Arizona for the mountains of Colorado","weather":"Again, unrelentingly clear, temps topping in the low 80s","x":37.348883,"y":-108.585927,"cx":37.348883,"cy":-108.585927,"description":"A shorter day, leaving Arizona for the mountains of Colorado","date":"Monday, March 30","title":"In Navajo Nation, some hospitality for wayward cyclists","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">A</span>s I lay in my sleeping bag, out in the open, trying to sleep on a rough-hewn table pushed up against an adobe wall outside a Navajo trading post in the NW corner of Arizona, I had to admit to myself: This could have been a lot worse.<p>\nThis was Fifer's and my town-too-far day, trying to get from Kayenta, Ariz., to the next town, 115 miles away in Colorado, and realizing that we were not going to make it. This is a region of slim margins; there is little water, few towns and a sparse economy. After 75 miles on Sunday, we had one option — the lone trading post at Teec Nos Pos.<p>\nWe'd gotten there Sunday on one of our grander days — wind at our backs for 75 miles across the lonely rolling hills, with mountains of pink and saffron of the Navajo desert. The edge on the day came from the fact that we were not sure of so many things — outposts along the way, the terrain and where we would spend the night.<p>\nWe found three outposts along the way, two of which are not on the map. The largest was at Mexican Water, a gas station, laundromat and restaurant, 43 miles from anything resembling a settlement. But you find talkative people there, and an excellent grilled cheese with tomato. A man we spoke to at the next table over gave us a scouting report on our next 30 miles, and mentioned how lucky we were with the wind. I mentioned that a little shade would be nice. He pointed east and said, \"That way, about 50 miles.\"<p>\nThe only real drama during the day came in the midst of riding a 10-mile stretch of four-foot-wide shoulder with an 18-inch rumble strip in the middle, making a narrow and often diminishing path for bikes. Fifer descended into an inconsolable Rumble Strip Rage (his term) in which I allowed him to wallow, and then rode off. (Rumble strips: Don't get us started.)<p>\nThe moment of truth came at the Teec Nos Pos outpost. We walked in, I introduced us to the woman, Michele, at the cash register. I asked if there was anywhere around there that we could camp. She said, \"They usually camp back behind the hay.\" We'd become a \"they.\"<p>\nWe went to look at what was behind the hay. It was an open and clearly operable livestock pen that had two main attributes: Shade, and an unobstructed view of the occupied sheep pen next door. To let you know where my head was at that moment, I was thinking: This could work. I even showed Fifer that, with a rake at hand, we could clear away the dried manure and create a cozy place for the night. Fifer, meanwhile, was dreaming of a seasonally-closed campsite five miles away on the San Juan River that he'd seen months before on Google Earth.<p>\nI went back to discuss details with Michele. A colleague had joined her. When she heard the conversation, her colleague said, \"Sometimes they also stay on the patio.\" I said, \"By they, do you mean stranded people?\" She said, \"Right.\" People get stranded here, and people here on the reservation take care of them. The patio was it. Fifer deployed his hammock between a tree and a steel arbor; I got the table. The stars were magnificent; the morning wild with birds and cold. My only remorse: I asked Michele if there would be a charge for our campsite. She said no, as if the question had come from a guest. I was a little ashamed for asking; I should have gotten their embracing vibe.<p>\nToday, Monday, we made it to Colorado, to Cortez, in about 45 beautiful miles that left the desert for the dry foothills of the Rockies. The drama: About 25 miles into the day, Fifer's left crank — the arm that holds the pedal — dropped off. There had been noises, he said, but then the spindle cracked and broke. Fun. Fifer rethreaded it, retightened it and we made it into town, delicately, and went directly to Kokopelli Bike Shop, which pledged to have a new crank installed tomorrow, a day off here in Cortez.<p>\nFor the record, the equipment carnage so far is: eight spokes, one fender, a crank arm and one disc brake pad. The mileage across Arizona: 564 miles.\n","photo":"http://stmedia.startribune.com/images/desertmorning.jpg","caption":"Vast nothingness: The cyclists departed this site in northeastern Arizona.","video":"null","other_media":"null"},{"num":17,"day":16,"last_stop":"Teec Nos Pos, Ariz.","distance":74.57,"total_miles":762.25,"speed":"","duration":7,"terrain":"Another desert cruise","weather":"Unrelentingly clear, temps in the upper 70s","x":36.92111,"y":-109.085658,"cx":35.973595,"cy":-112.126557,"description":"Another desert cruise","date":"Sunday, March 29","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":16,"day":15,"last_stop":"Kayenta, Ariz.","distance":73.96,"total_miles":687.68,"speed":"","duration":8,"terrain":"A long cruise across the desert","weather":"Utterly clear and in the 70s","x":36.727777,"y":-110.254577,"cx":35.973595,"cy":-112.126557,"description":"A long cruise across the desert","date":"Saturday, March 28","title":"Lessons on pedaling in a hot, vast desert","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">O</span>ur planning for the trip was based on some experience touring, some experience traveling in Arizona, but no experience bicycle touring in Arizona. It's a tough state. For example, since Fifer and I descended out of the cool Ponderosa and Pinion forests at the Grand Canyon into the red and saffron desert here in the Navajo Nation reservation, we have not ridden in shade for a day and a half. We're going through our spf 70 rapidly, huddling under shrubs on breaks. With the altitude, this might be why we have not seen another traveling cyclist for a week.<p>\nSo now we've ridden ourselves into a corner — or, rather, Four Corners. As long as we've looked at maps, we knew that the day we would head east from Kayenta, south of Monument Valley, would be a challenge, since the closest place, literally, is 115 miles away, in Cortez, Colo. We'd talked about making a one-day go of it, as we have done 100-plus-mile days at home. We also saw no other options. We now know that's not going to happen in the Arizona desert. We have to find somewhere to sleep Sunday night near the Four Corners Monument, where Utah, Arizona, New Mexico and Colorado come together, about 75 miles away. There are no campgrounds there as such. We can't call ahead because our cell phones don't work in Kayenta. So we head out Sunday morning .... intrigued.\n","photo":"http://stmedia.startribune.com/images/tonybrownlongdesert.jpg","caption":"The Navajo Nation reservation is big country for bike travel.","video":"null","other_media":"null"},{"num":15,"day":14,"last_stop":"Tuba City, Ariz.","distance":82.18,"total_miles":613.72,"speed":"","duration":8.5,"terrain":"A wild ride from the Grand Canyon into the Navajo Nation desert","weather":"Clear again — cool in the mountains and 80s in the desert","x":36.134993,"y":-111.239863,"cx":35.973595,"cy":-112.126557,"description":"A wild ride from the Grand Canyon into the Navajo Nation desert","date":"Friday, March 27","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":14,"day":13,"last_stop":"Grand Canyon National Park","distance":7.2,"total_miles":531.54,"speed":"","duration":1,"terrain":"Rest day","weather":"Clear in the 60s","x":36.106965,"y":-112.112997,"cx":35.973595,"cy":-112.126557,"description":"Rest day","date":"Thursday, March 26","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":13,"day":12,"last_stop":"Tusayan, Ariz.","distance":53,"total_miles":524.34,"speed":"","duration":6.5,"terrain":"Great landscape, lousy shoulder","weather":"Cool, breezy","x":35.973595,"y":-112.126557,"cx":35.973595,"cy":-112.126557,"description":"Great landscape, lousy shoulder","date":"Wednesday, March 25","title":"A cyclist’s guide to the Grand Canyon: Don’t fall off the skinny shoulder","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">T</span>en days and 523 miles in, at the Grand Canyon, and we're feeling reflective.<p>\nIn a way, we are on schedule, such as there was a schedule. We're averaging 65 miles a day, but the terrain has been rougher than it looked on our tablet screens. We are now closer to 7,000 feet above Dog Beach in San Diego and we've crested 6,000 feet four or five times. For the first time in my life I have dreams of Oklahoma.<p>\nWe have established a routine. Because we're usually in bed by 9, we're up at 5. Puttering and repacking usually makes us ready for breakfast at 6. Our bikes are usually reloaded by 7, but we rarely hit the road until 7:30, in full light. If there's a chance, we have second breakfast at midmorning. Then we just nibble — trail mix, dried fruit, Slim Jims (one of us) — until dinner. Or we have lunch if we can find a roadside diner, if there's no second breakfast.<p>\nWe usually arrive at our destination by 3 or 4. Clean up. Rest a bit. Connect with home. Update the blogs. Apply ice packs. And then, dinner. A note on food: We have mostly been in small towns, distant from large ones, and the rewards have been inconsistent, heavy on Mexican, Chinese and pizza. For the record, the best burrito was at Patty's in Brawley, Calif. (when she saw Fifer and me trying to translate the menu on the wall, which was in Spanish, she said, \"Tell me what you want.\" I said, \"Breakfast burrito? She said, \"Jamon?\" I said, \"Si.\" Fifer said, \"Dos.\") The best dinner overall was at Nichols West in Congress, Ariz., a town that does not otherwise have significant ambitions. Nichols is run by Simon Nichols, an Englishman who wanted to get out of the wet weather, and has succeeded. Try the crab cakes. Best pizza: Bill's in Prescott, no doubt. Best beer: Kilt Lifter, and ale from Tempe, Ariz.<p>\nWe arrive tired at the end of the days not just because of the miles or the mountains, but also the concentration necessary for the rides. This is a bit of a surprise. There have been carefree rides — we zenned-out for about 30 miles of central Arizona, enjoying a lovely survey of cacti, from Saguaro to Ocotillo, which at eight to 12 feet looks like a day lily gone mad, with huge peach-yellow flowers bobbing on each stem. <p>\nThen there are days like yesterday, on US 64, the main funnel into the Grand Canyon from the south. Millions of people use it every year, including (people tell us) many people on bikes. But the shoulder, at it's best, is 30 inches wide, the left 12 inches taken up by a rumble strip, and the right side a drop-off into loose sand and gravel. The rideable space in places drops six inches, with trains of tour buses whizzing along on your left. A 52-mile day of that takes a lot out of you — like riding your bike on a balance beam. This is not an obscure rural road. The Arizona DOT should be ashamed. In January, a young woman from Europe was killed on that road when she momentarily lost control and swerved into traffic.<p>\nAnother surprise: At home, on long rides, I often listen to music. On the road here, my iPod hasn't been touched. Too much going on, I guess. The days just go — poof. We've learned to become methodical: If we haven't eaten anything by 10, we stop and eat something. We nibble something every two hours. We have learned never to leave a town or gas station without full water bottles. You only arrive at a destination dry once. We have become bird-in-hand people: If you're hungry, take what's there. On our third day we planned to stop in Seeley, Calif., for lunch, since its name was in large letters on the map. But Seeley just had an uninviting market-gas station. It looked like there was something more promising four miles away; there wasn't. Hungary and thirsty, we stopped at a similarly uninviting place more than an hour later. That won't happen again.<p>\nWe're also feeling reflective because we have four unpredictable days ahead of us, getting from The Canyon (as they call it here) to Colorado, across the Navajo Nation. Everything is so spread out — 70 to 110 miles between everything — we are thinking we might have to spend a night in the desert, in sleeping bags with bivy sacks. Fun! May the winds blow at our backs.<p>\nBut today we have a free afternoon at The Canyon. Next stop: Tuba City.\n\n","photo":"http://stmedia.startribune.com/images/tonybrowngrandcanyon.jpg","caption":"Will Fifter enters Grand Canyon park. It's $12 for bikes — and no lanes or shoulders for bikes.","video":"null","other_media":"null"},{"num":12,"day":11,"last_stop":"Williams, Ariz.","distance":68.87,"total_miles":471.34,"speed":"","duration":7.5,"terrain":"A lovely high desert cruise, then a hard climb","weather":"Cool and clear","x":35.249457,"y":-112.191003,"cx":35.973595,"cy":-112.126557,"description":"Lovely desert cruise, then a hard climb","date":"Tuesday, March 24","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":11,"day":10,"last_stop":"Prescott, Ariz.","distance":0,"total_miles":402.47,"speed":"","duration":0,"terrain":"Rest day","weather":"Clear, in the mid-60s","x":34.540024,"y":-112.468502,"cx":33.781142,"cy":-113.614652,"description":"Important date with bike shop","date":"Monday, March 23","title":"Prescott, Ariz.: Where cyclists can be saved","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">T</span>o the list of loneliest places add the view down a vacant desert highway, a broken bike at your feet.<p>\nTo the list of purest cheap thrills add slouching down the 700-foot descent into the piney mountain college town of Prescott, Ariz., with the same balky, one-brake bike, 98 miles, 6,000 vertical feet, and two days later, knowing that a bike shop repair bay has your name on it.<p>\nAll anyone needs to know about getting here Sunday is a) we had no choice, and b) that we came over a mountain on US 89, covering 45 miles and climbing 4,500 feet, ending at Prescott, at 5,300 feet. As a matter of full disclosure, we walked our bikes up at least five miles of the steepest of the switchbacks.<p>\nWhat's important is that I had a 9 a.m. appointment Monday at the High Gear Bicycle Shop, chosen rather randomly from online comments. And what's most important is that I was greeted by the calm, bespectacled presence of one Steve Alward, owner of the shop for 37 years. He looked at my bike and said instantaneously, \"That's bent,\" pointing to my front fork. I was in love.<p>\nIn three hours, Steve straightened my fork, reclaiming at least an inch of wheel base (one of the other mechanics told me, \"Steve used a tool I hadn't seen before\"), rearranged and added eight spokes to my front wheel, trued the thing up straight and round, adjusted my brakes, and cleaned my chain. It rides beautifully. I said thank you, thank you, thank you to Steve back in the shop as I left, and he just waved, and went back to work. Steve's business card for the shop just says Steve; I had to ask at the cash register for his last name.<p>\nWe're ready, after a day off, to head tomorrow for the Grand Canyon, two days away. But Fifer and I are spending more time talking about later in the week. That's when we have to face the vacant 110-mile stretch across northeast corner of Arizona into southern Colorado. If the weather's bad, we need a Plan B, and none has presented itself just yet.\n","photo":"http://stmedia.startribune.com/images/Prescott1.jpg","caption":"Brown and Fifer rest along the switchbacks between Congress and Yarnel, Ariz. ","video":"null","other_media":"null"},{"num":10,"day":9,"last_stop":"Prescott, Ariz.","distance":44.91,"total_miles":402.47,"speed":"","duration":7,"terrain":"Relentlessly up, maxing at 6,100 feet","weather":"Spring in the desert, 50 to 87 degrees","x":34.540024,"y":-112.468502,"cx":33.781142,"cy":-113.614652,"description":"Relentlessly up","date":"Sunday, March 22","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":9,"day":8,"last_stop":"Congress, Ariz.","distance":53.41,"total_miles":357.56,"speed":"","duration":6.5,"terrain":"The prettiest highway yet, US 71 between Aguila and Congress, Ariz.","weather":"Perfect spring desert day — average 76 degrees","x":34.162526,"y":-112.850737,"cx":33.781142,"cy":-113.614652,"description":"Perfect day for a bike ride","date":"Saturday, March 21","title":"Crash! A cyclist falls in the desert","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">T</span>he sickening crunch is the first thing I vaguely remember, followed by the vague notion that I was airborne, then hitting the pavement. Then it was all clear: I was on the shoulder of US 60 between Brenda and Hope, Ariz., with by bike and gear on top of me and scattered into the ditch. What oh what happened?<p>\nClear right away. The shoulders of the nation's highways are strewn with crap, one piece of which was a 4-inch-long, 3-eighth inch think hunk of steel. I didn't see it. Apparently — and this is a one in a million shot — I had hit the thing on the edge, it popped up into my spokes, and then in a micro second lodged against a strut for my fender and the front fork. The bike stopped, at between 10 and 12 mph, like I'd hit a wall.<p>\nNow what? We took stock. The wheel was a horror, spokes pointing in all directions. Other than a few scrapes and some shock, I was OK. But we were 50 miles into a 60-mile day and the next town of any size — Salome, Ariz., 1,700 people — was 10 miles away. In these instances Fifer and I have similar reactions: We become formal and logistical. The difference is that Fifer has actual skills and know-how. And I finally remembered why I wanted to ride across country with him — he's a genius.<p>\nWe removed the crumpled fender, and then I removed the tire and tube from the wheel; they were fine. As we slowly removed the broken spokes we then had a number: eight spokes were shredded or broken; one was bent but useable. At that point, Fifer took a breath and sat down on the dirt next to US 60 and methodically redistributed 26 spokes evenly among the 32 holes in the wheel. I was invaluable, handing him tools and standing so that I shaded him from the sun, tapping out all of my skills. But we were saved — by Fifer. My bike could be ridden.<p>\nWhen we got everything back together, maybe 75 minutes after I'd hit the pavement, it was clear that I would be riding a bit off a biking jalopy. In the field, short spokes, we couldn't make the tire exactly round; it's a little bumpy. The front brake is temporarily useless. And it appears that the front fork was bent a little aft. I've lost wheel base. But we limped into Salome and, today, advanced 53 more miles to Congress, Ariz., with a plan. We're now just 45 miles from Prescott, a good-sized town with bike shops. We have spoken to one of them and they are expecting us at 9 a.m. Monday morning to clean up the mess. The only complication is that Prescott is more than 2,000 feet higher than Congress, and we are, we've admitted, tired of legs and sore of saddle.<p>\nBut compared to 24 hours ago? We are ready for anything. If all goes well, we'll have a day’s rest and working bikes by Tuesday morning, when it will be just a couple of days to the Grand Canyon.<br><br>\n****<br><br>\nWe have our trans-Am team's first Four Star Motel. It is the Westward Motel in Salome, Ariz. It is a four-unit gem, first built in 1942 as the first cars were coming across country. It became derelict until Rande Wolters bought the heap more than 10 years ago and has created a place that feels like 1942 with some 21st Century western aplomb. Cactus, shaded gardens, found and created desert art (much of it from his partner, Janet), preserved original signs, and cozy rooms — all in a town that is a little short on style. Rande, with silver hair and a big silver mustache, has a little of the sly Sam Elliott thing going on, and he asks to be paid in cash. Our legacy: I asked him where I could dispose of broken spokes and fender struts. He took them with a grin, saying Janet would be wanting to make something of them.<br><br>\n****<br><br>Catching up, I should probably mention we made it out of California. We were slightly intimidated by the challenge — 87 miles across the desert from Brawley in the Imperial Valley to Blythe on the Arizona border. But we caught a break: A cool, overcast, even rainy day. To cross Saharan dunes and scrub desert in six-plus hours of riding with an average temperature of 64.2 degrees (Garmin says), was a dream.<p>\nAnd, suddenly, the road was lousy with cross-country cyclists. We'd heard, back in San Diego, that the Adventure Cycling Association was launching a van-supported group of 12 people a day behind us, on our route. But on the first four days we saw almost no other people traveling on bikes — just an Englishman, with an over-loaded bike in Jacumba at the Mexican border, and a New Zealander, heading west in El Centro, both traveling alone.<p>\nBut in the dunes crossroad of Glamis, Calif., the group caught up with us. The van carries their gear, so they're on light, fast carbon bikes. And Glamis, by way, is to-be-misssed. Fifer called it a redneck Wall Drug, a line I liked even though it was uncharitable. More to the point, it is a dingy dump catering almost exclusively to the hundreds of ATVers who rampage across the desert there. It's $2 to use the bathroom, and I'm guessing most everyone there just goes outside.<p>\nWe also met a woman from Montreal, also traveling alone. She said she's going as far as Texas, to see the county and get in shape before going home. We ran into her again in Blythe, where she was scrounging inner tubes after two flats in a day. But we haven't seen her since.\n\n","photo":"http://stmedia.startribune.com/images/bike22.jpg","caption":"Will Fifer heads east, exiting California's Imperial Valley at dawn.","video":"null","other_media":"null"},{"num":8,"day":7,"last_stop":"Salome, Ariz.","distance":63,"total_miles":304.15,"speed":"","duration":7,"terrain":"Long hill climbs followed by a long desert cruise","weather":"Clear in the 80s","x":33.781142,"y":-113.614652,"cx":33.781142,"cy":-113.614652,"description":"Long hills, desert cruise","date":"Friday, March 20","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":7,"day":6,"last_stop":"Blythe, Calif.","distance":87.01,"total_miles":241.15,"speed":"","duration":7.5,"terrain":"Roller coaster two-lane across the desert","weather":"Cool, overcast with rain; temps in 70s","x":33.617773,"y":-114.588261,"cx":33.781142,"cy":-113.614652,"description":"More terrifying two-lanes","date":"Thursday, March 19","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":6,"day":5,"last_stop":"Brawley, Calif.","distance":0,"total_miles":154.14,"speed":"","duration":6,"terrain":"Rest day","weather":"Scattered clouds, temps in the 80s","x":32.978657,"y":-115.530267,"cx":33.781142,"cy":-113.614652,"description":"Still in Brawley","date":"Wednesday, March 18","title":"Dropping like rocks: Or, exiting the mountains on loaded bikes","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">W</span>e are out of the mountains. On Monday we chugged over the Laguna Mountains, topping 4,000 feet three times through dry grass ranching country — 47 miles in which we climbed 4,360 feet. Our reward: Jacumba, a largely boarded up border town, buzzing with white Border Patrol trucks and a splendid view of the brown border fence. The main attraction is Jacumba Hot Springs, which had huge coolers of beer and pools of hot spring water, and it was not a mirage.<p>\n\nThe drama came Tuesday. We knew we would be dropping from close to 3,000 feet down to roughly sea level; we did not know that we would be dropping like a rock. Our route merged us on to I-8 at In-Ko-Pah Gorge. We proceeded to drop 2,200 feet over 9.8 miles in 25 minutes. On loaded bikes. Exciting certainly, but not as much fun as one would hope, what with the wind gusts up through the gorge, the semi-tractor trailers whizzing by on our left, and the rocks and the sand on the shoulder. We would of course do it again, if we could get our braking hands to uncramp.<p>\n\nAt the bottom, we found what was unambiguously the desert. The glare and heat climbed, but it was at least flat. We could for the first time cruise at 12 to 17 mph, for miles and miles at a time. After a vacant 21-mile stretch — kale! The world went from gray to green as we entered the Imperial Valley, which sluices the Colorado River into the desert to feed the world. You can ride miles and not get through the carrots. Fascinating place, but also in the 90s, and nearly 160 miles from the beaches of San Diego. We're taking the day off to rest and do laundry.<p>\n\nAnd we have another interesting day ahead of us tomorrow. The 85 miles from here to Blythe, on the Arizona border, are also vacant, except for a gas station that someone told us \"is a scene from Road Warrior.\" We're headed off now for extra water and food to get us there.\n\n","photo":"http://stmedia.startribune.com/images/Hwy+98.jpg","caption":"Will Fifer rides the shoulder on California Highway 98 along the Mexican border.","video":"null","other_media":"null"},{"num":5,"day":4,"last_stop":"Brawley, Calif.","distance":70,"total_miles":154.14,"speed":"","duration":6,"terrain":"From Interstate highways to almost un-rideable two lanes in the desert","weather":"hot, with a high of 91","x":32.978657,"y":-115.530267,"cx":33.781142,"cy":-113.614652,"description":"Two lanes in the desert","date":"Tuesday, March 17","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":4,"day":3,"last_stop":"Jacumba, Calif.","distance":47.15,"total_miles":84.14,"speed":"","duration":6,"terrain":"Cleared mountains, headed for the desert","weather":"hot and clear","x":32.61768,"y":-116.187424,"cx":33.781142,"cy":-113.614652,"description":"Mountains, mountains, mountains","date":"Monday, March 16","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":3,"day":2,"last_stop":"Alpine, Calif.","distance":36.99,"total_miles":36.99,"speed":"","duration":5.5,"terrain":"Relentlessly uphill","weather":"Hot and dry","x":32.835052,"y":-116.766411,"cx":33.781142,"cy":-113.614652,"description":"A challenging first day","date":"Sunday, March 15","title":"Bad brakes, back-breaking hills: ‘We’re not going to call this a tough day’","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">T</span>his morning, even before we got coffee from Lizzie, the nice woman at Tiki Coffee; before we spent time with the scores of dog walkers on Dog Beach; long before we had to pause to allow a 4-foot Pacific Rattlesnake slither by us, Fifer popped a pad on his rear disc brake. It was the first of several developments in the day that did not go precisely as planned.<p>\nBut we left for the beach with the rising sun encouraged. Our bikes had arrived intact and took just a few hours to reassemble. Even with the tension and confusion of a new trip's first day, the bikes took our gear well. We thought basically 30 pounds of stuff on 30-pound bikes. Sort of felt like driving a car pulling a slightly too-large boat. You get used to it.<p>\nBut this is a day that, in the future, we will manage differently. Our directions out of San Diego were complex, with lots of turns and many chances to miss them. We were so focused on maps, we forgot the weather we were in: Hot, windy, and very dry. Late in the morning we had to just stop, acknowledge that we'd been too antsy, and eat something. Then we took a wrong turn in a big state park and lost 45 minutes (this is where we met the snake). Mostly it was just hot, about 15 degrees above normal. According to my Garmin, the average temperature today was 86.9 degrees, and topped out at 100. I put a soaking wet bandanna around my neck and it was dry in an hour.<p>\nWe decided it was not a day for heroics. We'd hoped to be in Pine Valley, 47 miles and 3800 feet up from the beach. We declared victory and stopped here at Alpine, 37 miles and 2600 feet higher than the beach in San Diego. I asked the woman who checked us into our motel if there was a special name for the nasty two-mile-long hill coming into town. She said no, and then sort of snorted a laugh, saying, \"Oh yeah, that's right, you haven't been to Pine Valley yet. We get a lot of bikers through here and they say getting up there is much worse.\" Fine.<p>\nThis will complicate our next few days. We hoped to be in El Centro tomorrow night, but that's now a long climb and 100 miles from Alpine, where we are resting first-day legs. And the problem is that there is virtually nothing in the 100 miles after that to Blythe, at the Arizona border. It's hard to add extra days when there are no extra towns. We have this advantage: After Pine Valley, it's mostly downhill to El Centro, which is actually below sea level right at the Mexican border.<p>\nSo we're not going to call this a tough day. Looking ahead, we'd have to ask — compared to what?","photo":"http://stmedia.startribune.com/images/BrownFiferdayone.jpg","caption":"Tony Brown and Will Fifer posed for a photo just before leaving San Diego.","video":"null","other_media":"null"},{"num":2,"day":2,"last_stop":"San Diego","distance":0,"total_miles":0,"speed":0,"duration":0,"terrain":"","weather":"","x":32.715738,"y":-117.161084,"cx":33.781142,"cy":-113.614652,"description":"Ready to ride","date":"Sunday, March 15","title":"","entry":"","photo":"","caption":"","video":"null","other_media":"null"},{"num":1,"day":1,"last_stop":"Minneapolis","distance":0,"total_miles":0,"speed":0,"duration":0,"terrain":"Flat (we're still in Minnesota)","weather":"Spring-like and lovely","x":44.977753,"y":-93.265011,"cx":44.977753,"cy":-93.265011,"description":"Ready for the big trip","date":"Thursday, March 12","title":"<p>A cross-country cyclist's first question: Where the heck is my bike?</p>","entry":"<p class=\"firstGraph\"><span class=\"dropCap\">L</span>ast Friday, we meticulously disassembled our bicycles and packed them into sturdy boxes, along with whatever gear we could fit around them. We then delivered the boxes, more than 50 pounds each, to the FedEx office on Washington Avenue SE on the University of Minnesota's Minneapolis campus. We witnessed the scanning-in of the boxes at 1:30 pm, and later in the day confirmed through the online tracking that the boxes were in the FedEx system, ticketed for their intended destination -- Moment Bicycles on Historic Decatur Road in the Loma Portal neighborhood of San Diego, California. We received an update Saturday morning: The bikes had departed St. Paul aboard a truck at 6:38 am., west-bound, we hoped.<br><br>\nThen, nothing. No intermediate updates for almost 105 hours,\nuntil 3:05 pm and 3:09 pm, respectively, local time Wednesday. The bikes were\nin .... Bloomington! Wait -- Bloomington, California, it turned out. Since that\nBloomington is a far-eastern suburb of Los Angeles, we considered this\ngenerally good news, except that we also knew the boxes still had to be\ndiverted to San Diego, two hours away, processed, and then sent out for\ndelivery today, Thursday. A case could be made, probably, that FedEx does this\nkind of thing all the time. Still, the last we knew, the boxes left Bloomington\nat 9:55 pm local time Wednesday, fewer than 20 hours from the deadline. We hope\nthey're not headed for Duluth.<br><br>\nAll just another detail in the very odd and surreal process\nof disentangling your life for two months away, on the road.<br> \n<br><b>Read more!</b><br>Brown previews his ride with an essay in Friday's Outdoors Weekend section. Read it <a href=\"http://www.startribune.com/sports/outdoors/296115251.html\" target=_blank\">here</a>. Check back Monday for Brown's first post from the road.","photo":"http://stmedia.startribune.com/images/tonysbox.jpg","caption":"Bike in a box: Brown packed up his wheels and shipped them to San Diego. ","video":"null","other_media":"null"}]}