{"events":[{"index":1,"date":"January 1999","title":"Medtronic Buys Infuse","description":"Medtronic acquires Sofamor Danek, the owner of the rights to sell a form of the protein called &#34;rhBMP-2,&#34; in a roughly <a href='http://www.marketwatch.com/story/sofamor-danek-shares-soar-after-medtronic-deal-11-02-98' target='_new'>$3 billion, all-stock deal</a>.","media":null},
{"index":2,"date":"September 1999","title":"Pilot Study Starts","description":"The first cervical-fusion patient is treated with bone morphogenetic protein (BMP) in an Food and Drug Administration-approved trial, making cervical-spine fusion one of the original procedures in which BMP is tested on humans.","media":null},
{"index":3,"date":"January 2002","title":"Off-Label Concerns raised","description":"FDA experts are warned doctors will use rhBMP-2 in many parts of the body, after it is approved in just one part of the body, which is the lower back. An FDA director urges panel members not &#34;speculate&#34; on other uses.","media":null},
{"index":4,"date":"July 2002","title":"Infuse Approved","description":"The FDA <a href='http://www.accessdata.fda.gov/cdrh_docs/pdf/P000058a.pdf' target='_new'>grants Medtronic&#39;s premarket approval (PMA) application</a> for a product called &#34;the InFUSE Bone Graft/LT-CAGE Lumbar Tapered Fusion Device,&#34; which includes both a metal device and the biologic drug BMP. The FDA says this product device is safe and effective when used to fuse vertebrae in the lower back, with no mention of upper spine.","media":null},
{"index":5,"date":"June 2003","title":"Cervical Results","description":"The 1999 pilot study of Infuse in cervical fusions, <a href='https://www.ncbi.nlm.nih.gov/pubmed/12811263' target='_new'>published in Spine</a>, reports no device-related adverse events or complications among 18 Infuse anterior cervical diskectomy fusion (ACDF) patients. Years later, the study report is criticized for omitting mention of Medtronic&#39;s role as an editor, and for being one of the early company-funded papers that underestimated the risks and helped drive off-label use.","media":null},
{"index":6,"date":"April 2004","title":"‘Concerns&#39; Email","description":"Medtronic consultant Dr. Scott Boden tells Medtronic Spine executive Rick Treharne that he has begun hearing ‘concerns&#39; from the field about swelling in BMP cervical fusion cases, including one colleague who saw a &#34;golf-ball size mass&#34; in an ACDF patient with BMP, which he has never seen in any non-BMP ACDF procedure. Boden also mentions one &#34;death in the literature.&#34; (Source: Senate Finance Committee exhibits, pgs 2119-2121)","media":null},
{"index":7,"date":"June 2004","title":"‘Our No. 1 Complaint&#39;","description":"Treharne emails another key Medtronic consultant, Dr. Kenneth Burkus, to say that &#34;swelling in the cervical spine&#34; has become Medtronic&#39;s &#34;No. 1 complaint&#34; about BMP. However, Treharne concludes that swelling can also happen without BMP, and, &#34;In sum, I just do not, at this time, see anything here to worry about. (Source: SFC pgs 2122-2126)","media":null},
{"index":8,"date":"September 2004","title":"Medtronic Safety Alert","description":"Medtronic sends doctors a one-page &#34;Safety Alert,&#34; signed by Treharne, reporting an undisclosed number of cases of &#34;localized soft tissue edema&#34; following off-label surgeries using Infuse in anterior cervical fusions. &#34;These occasional complaints have not been associated with neurological deterioration … Since these complaints have also been reported after cervical surgery without the use of INFUSE Bone Graft, in the absence of complete data, it is unknown whether these incidences are solely related to the use of INFUSE Bone Graft. … Our investigation is still ongoing.&#34; The number of off-label cervical-spine fusions with Infuse in the U.S. doubles between 2004 and 2006.","media":null},
{"index":9,"date":"May 2005","title":"Another Positive Study","description":"<a href='http://thejns.org/doi/abs/10.3171/spi.2005.2.5.0521' target='_new'>A retrospective study of 24 cases</a> of off-label BMP use in ACDF at Emory University in Atlanta finds, &#34;ACDF involving an rhBMP-2-filled PEEK spacer leads to good clinical outcome and solid fusions (even in multilevel cases) while avoiding the complications associated with harvesting iliac crest bone grafts.&#34; An assessment of this article in The Spine Journal later criticized the report&#39;s false conclusion that the results demonstrated the safety and efficacy of the procedure with 100% fusion rate and &#34;no significant morbidity.&#34;","media":null},
{"index":10,"date":"November 2006","title":"Internal Study Begins","description":"Patients begin signing informed consent affirmation forms for a Medtronic-sponsored project titled, &#34;A Retrospective Study of the Use of Infuse Bone Graft In Clinical Practice.&#34; Eventually 3,647 surgeries are studied, the vast majority of them for unapproved uses of Infuse. Medtronic executives say later that someone at the FDA had suggested this observational study could be used to support additional approvals for Infuse.","media":null},
{"index":11,"date":"April 2007","title":"First Cervical Complication","description":"The first report of an ACDF patient with complications is received in Medtronic&#39;s retrospective study. It&#39;s a patient who had a &#34;neurological deficit/dysfunction&#34; following a C5-C6 anterior cervical fusion with a 2.8 milliliter packet of BMP.","media":null},
{"index":12,"date":"June 2007","title":"Pivotal Study Begins","description":"Separate from its internal retrospective study, Medtronic begins its FDA-approved pivotal study of Infuse cervical fusion using PEEK spacers. The trial will include up to 225 patients who get either 0.6 mg of BMP or 1.05 mg of BMP. The results are never published in a journal, but <a href='https://clinicaltrials.gov/ct2/show/results/NCT00485173?term=Pivotal+Infuse+Cervical+PEEK&rank=1&sect=X4301256' target='_new'>tabulated results</a> posted in 2012 show five patient deaths and a high rate of dysphagia.","media":null},
{"index":13,"date":"November 2007","title":"Last Cervical Complication","description":"The final cervical fusion in MOAS is recorded, bringing the number of cases of cervical fusions with complications in Medtronic files to at least 118. The study is closed down ahead of schedule, and the results are archived internally. Medtronic executives later explain that the company wasn&#39;t clear on its duty to report the results, and that the study was stopped after the FDA indicated it could not be used to expand the label.","media":null},
{"index":14,"date":"July 2008","title":"FDA Alert","description":"<a href='http://www.fda.gov/MedicalDevices/Safety/AlertsandNotices/PublicHealthNotifications/ucm062000.htm' target='_new'>The FDA warns</a> of life-threatening complications associated with rhBMP when used in the cervical spine. The report is based on at least 38 reports of swelling in the neck, leading to compression of airways and &#34;neurological structures&#34; in the neck, and difficulties swallowing, breathing and speaking. The warning hurts Infuse sales.","media":null},
{"index":15,"date":"October 2008","title":"DOJ Subpoena","description":"<a href='https://www.sec.gov/Archives/edgar/data/64670/000089710108002439/medtronic084960_10q.htm' target='_new'>Medtronic receives a subpoena from the U.S. Attorney&#39;s Office for the District of Massachusetts requesting Infuse documents</a>. Data from the internal study, now closed and archived, is not provided. The federal investigation closes in 2012.","media":null},
{"index":16,"date":"November 2008","title":"Sales Slump","description":"Medtronic <a href='https://www.sec.gov/Archives/edgar/data/64670/000089710108002439/medtronic084960_10q.htm' target='_new'>writes in a securities filing</a> to investors that Infuse sales growth in the quarter slowed. &#34;We believe growth was negatively impacted by physician and payor response to a FDA public health notice regarding use of bone morphogenetic protein (BMP) in cervical procedures and the overall regulatory scrutiny of off-label use in medical devices.&#34;","media":null},
{"index":17,"date":"July 2009","title":"JAMA study","description":"In a national analysis, researchers write <a href='http://jamanetwork.com/journals/jama/fullarticle/184181' target='_new'>in JAMA</a> that cervical fusion procedures with BMP are associated with longer hospital stays, higher odds of serious complications like dysphagia, and higher overall inpatient costs. Other procedures using Infuse are not found to have higher risks compared to the same surgery without the product.","media":null},
{"index":18,"date":"September 2010","title":"Off-label Use","description":"Off-label use of Infuse has skyrocketed. <a href='http://www.ncbi.nlm.nih.gov/pubmed/?term=Off-label+use+of+bone+morphogenetic+proteins+in+the+United+States+using+administrative+data' target='_new'>A study report published in Spine</a> finds that 85 percent of the 340,251 BMP surgeries between 2003 and 2007 were for off-label indications.","media":null},
{"index":19,"date":"June 2011","title":"Senate Inquiry","description":"Senate Finance Committee members <a href='http://www.finance.senate.gov/newsroom/chairman/release/?id=a7e974b6-b4b6-4e2c-a738-edefac30fcb6' target='_new'>send a letter to Medtronic CEO Omar Ishrak</a> asking for all documents pertaining to adverse postoperative events and/or medical complications relating to the use of rhBMP-2. The internal study data is not provided.","media":null},
{"index":20,"date":"June 2011","title":"Journal Attention","description":"The Spine Journal devotes an special issue to articles exposing a pattern of academic surgeons with financial ties to Medtronic omitting mention of serious side effects associated with Infuse. New CEO <a href='http://newsroom.medtronic.com/phoenix.zhtml?c=251324&p=irol-newsArticle&ID=1771294' target='_new'>Omar Ishrak says</a> the articles may have raised questions about researchers&#39; early conclusions, but did not affect the clinical trial data that Medtronic has submitted to the FDA. &#34;We strongly believe that the safety profile reported to the FDA and summarized in the product label support the safe use of rhBMP-2 for the identified indications.  We remain committed to ongoing study of the safety and efficacy of rhBMP-2, especially in applications not covered by FDA labeling.&#34;","media":null},
{"index":21,"date":"August 2011","title":"Yale Review","description":"<a href='http://www.infusebonegraft.com/healthcare-providers/about-infuse-bonegraft/the-yale-study/index.htm' target='_new'>Medtronic says that it has paid $2.5 million to commission</a> Yale University to conduct an independent review of data related to Infuse bone graft. Medtronic says it provided data from 17 completed clinical trials and adverse-event reports that were submitted to the FDA. The internal study data are not submitted to the researchers.","media":null},
{"index":22,"date":"May 2012","title":"DOJ Investigation Closed","description":"Medtronic announces that the US Attorney in Boston has <a href='http://newsroom.medtronic.com/phoenix.zhtml?c=251324&p=irol-newsArticle&ID=1769480' target='_new'>closed its federal criminal and civil investigation</a> into Infuse. Other investigations continue.","media":null}]}